if (typeof console == "undefined"){
    window.console = {log: function(){}};
}

map = new BMap.Map("container");
map.centerAndZoom(pname,10);
var stdMapCtrl = new BMap.NavigationControl({type: BMAP_NAVIGATION_CONTROL_SMALL});
map.addControl(stdMapCtrl);
map.enableScrollWheelZoom();
map.enableContinuousZoom();
function getBoundary(city,data){
    var bdary=new BMap.Boundary();
    bdary.get(data.split("-")[0],function(rs){
        console.log(rs);
        var maxNum=-1,maxPly;
        var color=data.split("-")[1];
        var count=rs.boundaries.length;
        for(var i=0;i<count;i++){
            var ply=new BMap.Polygon(rs.boundaries[i],{strokeWeight:1,strokeOpacity:0.5,fillColor:color,strokeColor:"#000000"});
            map.addOverlay(ply);
            ply.addEventListener("click",function(e){
                name=data.split("-")[0];
                var latlng=e.point;
                var info=new BMap.InfoWindow(name+" "+latlng.lat+","+latlng.lng,{width:220});
                map.openInfoWindow(info,latlng);
                //高亮闪烁显示鼠标点击的省
                delay=0;
                for (flashTimes=0;flashTimes<3;flashTimes++){
                    delay+=400;
                    setTimeout(function(){
                        ply.setFillColor("#FFFF00");
                    },delay);

                    delay+=400;
                    setTimeout(function(){
                        ply.setFillColor(color);
                    },delay);
                }
                location = "companyRisk.jsp?city="+encodeURI(city)+"&pname="+encodeURI(name)+"&lat="+encodeURI(latlng.lat)+"&lng="+encodeURI(latlng.lng);
            });
        }
        if(maxPly){
            map.setViewport(maxPly.getPoints());
        }
    });
}
map.clearOverlays();
var beijingshis = [
    "东城区-#FF0000", "西城区-#33FF00", "崇文区-#FF0066", "宣武区-#33FF00", "朝阳区-#FF3300",
    "丰台区-#33FF00", "石景山区-#FF0000", "海淀区-#FF0000", "门头沟区-#33FF00", "房山区-#FF3300",
    "通州区-#FF3300","顺义区-#FF0000","昌平区-#FF0066","大兴区-#FF0000","怀柔区-#33FF00", "平谷区-#FF0000", "密云县-#FF0000", "延庆县-#33FF00"];
var tianjingshis=[
    "和平区-#FF0000", "河东区-#33FF00", "河西区-#FF3300", "南开区-#33FF00", "河北区-#FF3300",
    "红桥区-#FF0000", "塘沽区-#33FF00", "汉沽区-#FF3300", "大港区-#FF0000", "东丽区-#FF3300",
    "西青区-#FF0000", "津南区-#33FF00", "北辰区-#FF0000", "武清区-#33FF00","宝坻区-#FF0000", "滨海新区-#33FF00", "宁河县-#FF3300", "静海县-#FF0000", "蓟县-#FF3300"
];
var shijiazhuangshis=[
    "长安区-#33FF00", "桥东区-#FF3300", "桥西区-#FF0000", "新华区-#FCFBBB", "井陉矿区-#FF3300",
    "裕华区-#FF3300", "井陉县-#FF0000", "正定县-#E7CCAF", "栾城县-#E7CCAF", "行唐县-#FF0000", "灵寿县-#FF0066",
    "高邑县-#FF0000", "深泽县-#33FF00", "赞皇县-#FF0000","无极县-#C8C1E3", "平山县-#FF0066", "元氏县-#FF3300", "赵县-#FF0066"
];
var tangshanshis=[
    "路南区-#FF3300", "路北区-#FF0000", "古冶区-#FF0000", "开平区-#FF0000", "丰南区-#33FF00",
    "丰润区-#33FF00", "滦县-#FF0000", "滦南县-#33FF00", "乐亭县-#FF0000", "迁西县-#FF0000",
    "玉田县-#33FF00","唐海县-#FF0000"
];
var qinghuangdaoshis=[
    "海港区-#FF0000", "山海关区-#FF0066", "北戴河区-#33FF00", "青龙满族自治县-#FF0066", "昌黎县-#FF0000",
    "抚宁县-#33FF00", "卢龙县-#33FF00"
];
var handans=[
    "邯山区-#FF0000", "丛台区-#33FF00", "复兴区-#FF0066", "峰峰矿区-#FF0066", "邯郸县-#FF0000",
    "临漳县-#FF0066", "成安县-#33FF00", "大名县-#FF0000", "涉县-#FBC5DC", "磁县-#FF0000",
    "肥乡县-#FF0000", "永年县-#FF0000", "邱县-#FF0000", "鸡泽县-#FF0066","广平县-#FF0066",
    "馆陶县-#FF0000","魏县-#33FF00","曲周县-#FF0066"
];
var xingtaishis=[
    "桥东区-#FF3300", "桥西区-#FF0000", "邢台县-#FF0000", "临城县-#FF0000", "内丘县-#33FF00",
    "柏乡县-#33FF00", "隆尧县-#FF0000", "任县-#33FF00", "南和县-#FF0000", "宁晋县-#E7CCAF",
    "巨鹿县-#DBECC8","新河县-#FF0000","广宗县-#FF0066", "平乡县-#33FF00", "威县-#FF0000", "清河县-#FBC5DC", "临西县-#FF0000"
];
var baodingshis=[
    "新市区-#FF0000", "北市区-#33FF00", "南市区-#33FF00", "满城县-#FF0000", "清苑县-#FF0066",
    "涞水县-#FF0066", "阜平县-#33FF00", "徐水县-#FF0000","定兴县-#FF3300", "唐县-#FF0000", "高阳县-#FF0000", "容城县-#FF0000", "涞源县-#33FF00",
    "望都县-#33FF00", "安新县-#FF0000", "易县-#33FF00", "曲阳县-#FF0000", "蠡县-#FF0000", "顺平县-#33FF00", "博野县-#FF3300", "雄县-#33FF00"
];
var zhangjiakoushis=[
    "桥东区-#FF0000", "桥西区-#FF0066", "宣化区-#33FF00", "下花园区-#FF0000", "宣化县-#FF0066",
    "张北县-#FF0066", "康保县-#FF0000", "沽源县-#33FF00", "尚义县-#33FF00", "蔚县-#FF0066", "阳原县-#FF0000","怀安县-#FF0000", "万全县-#33FF00", "怀来县-#FF0066", "涿鹿县-#FF0066", "赤城县-#FF0000",
    "崇礼县-#FF0066"
];
var chengdeshis=[
    "双桥区-#FF0000", "双滦区-#FF0066", "鹰手营子矿区-#33FF00", "承德县-#FF0066", "兴隆县-#33FF00",
    "平泉县-#33FF00", "滦平县-#FF0066", "隆化县-#33FF00", "丰宁满族自治县-#FF0000", "宽城满族自治县-#33FF00",
    "围场满族蒙古族自治县-#FF0000"
];
var cangzhoushis=[
    "新华区-#33FF00", "运河区-#FF0000", "沧县-#33FF00", "青县-#33FF00", "东光县-#33FF00",
    "海兴县-#FF0000", "盐山县-#FF0000", "肃宁县-#33FF00", "南皮县-#FF0000", "吴桥县-#FF0000", "献县-#FF0066",
    "孟村回族自治县-#FF0000"
];
var langfangshis=[
    "安次区-#FF0066", "广阳区-#33FF00", "固安县-#FF0066", "永清县-#FF0066", "香河县-#FF0000",
    "大城县-#FF0066", "文安县-#33FF00", "大厂回族自治县-#33FF00"
];
var hengshuishis=[
    "桃城区-#33FF00", "枣强县-#FF0000", "武邑县-#33FF00", "武强县-#FF0066", "饶阳县-#33FF00",
    "安平县-#FF0066", "故城县-#FF0066", "景县-#FF0066", "阜城县-#FF0000"
];
var taiyuanshis=[
    "小店区-#FF0066", "迎泽区-#33FF00", "杏花岭区-#FF0066", "尖草坪区-#FF0000", "万柏林区-#33FF00",
    "晋源区-#FF0000", "清徐县-#FF0000", "阳曲县-#33FF00", "娄烦县-#FF0066"
];
var datongshis=[
    "城区-#33FF00", "矿区-#FF0000", "南郊区-#33FF00", "新荣区-#FF0066", "阳高县-#33FF00",
    "天镇县-#FF0066", "广灵县-#FF0066", "灵丘县-#FF0066", "浑源县-#FF0000","左云县-#33FF00", "枣强县-#FF0000", "武邑县-#33FF00", "武强县-#FF0066", "饶阳县-#33FF00",
    "大同县-#FF0066"];
var yangquanshis=[
    "城区-#FF0066", "矿区-#33FF00", "郊区-#FF0066", "平定县-#FF0000", "盂县-#33FF00"
];
var changzhishis=[
    "城区-#33FF00", "郊区-#FF0000", "长治县-#33FF00", "襄垣县-#FF0066", "屯留县-#33FF00",
    "平顺县-#FF0066", "黎城县-#FF0066", "壶关县-#FF0066", "长子县-#FF0000","武乡县-#FF0066", "沁县-#FF0066", "沁源县-#FF0066"
];
var jinchengshis=[
    "城区-#FF0066", "沁水县-#FF0000", "阳城县-#FF0066", "陵川县-#FF0000", "泽州县-#FF0066"
];
var shuozhoushis=[
    "朔城区-#33FF00", "山阴县-#FF0000", "应县-#33FF00", "右玉县-#FF0066", "怀仁县-#33FF00",
];
var jinzhongshis=[
    "榆次区-#FF0066", "榆社县-#FF0000", "左权县-#FF0066", "和顺县-#FF0000", "昔阳县-#FF0066","寿阳县-#33FF00", "太谷县-#FF0000", "祁县-#33FF00", "平遥县-#FF0066", "灵石县-#33FF00"
];
var yunchengshis=[
    "盐湖区-#33FF00", "临猗县-#FF0000", "万荣县-#33FF00", "闻喜县-#FF0066", "稷山县-#33FF00",
    "新绛县-#FF0066", "绛县-#FF0066", "垣曲县-#FF0066", "夏县-#FF0000","平陆县-#33FF00", "芮城县-#FF0000"
];
var xinzhoushis=[
    "忻府区-#33FF00", "定襄县-#FF0000", "五台县-#33FF00", "代县-#FF0066", "繁峙县-#33FF00",
    "宁武县-#FF0066", "静乐县-#FF0066", "神池县-#FF0066", "五寨县-#FF0000","岢岚县-#33FF00", "河曲县-#FF0000", "偏关县-#33FF00"
];
var linfenshis=[
    "尧都区-#33FF00", "曲沃县-#FF0000", "翼城县-#33FF00", "襄汾县-#FF0066", "洪洞县-#33FF00",
    "古县-#FF0066", "安泽县-#FF0066", "浮山县-#FF0066", "吉县-#FF0000","乡宁县-#33FF00", "大宁县-#FF0000",
    "隰县-#33FF00", "永和县-#FF0000", "蒲县-#33FF00", "汾西县-#FF0066"
];
var lvliangshis=[
    "离石区-#33FF00", "文水县-#FF0000", "交城县-#33FF00", "兴县-#FF0066", "临县-#33FF00",
    "柳林县-#FF0066", "石楼县-#FF0066", "岚县-#FF0066", "方山县-#FF0000","中阳县-#33FF00", "交口县-#FF0000"
];
var huhehaotehis=[
    "新城区-#FF0066", "回民区-#FF0000", "玉泉区-#FF0066", "赛罕区-#FF0000", "土默特左旗-#FF0066",
    "托克托县-#FF0000", "和林格尔县-#FF0066", "清水河县-#33FF00", "武川县-#33FF00"
];
var baotoushis=[
    "东河区-#33FF00", "昆都仑区-#FF0000", "青山区-#33FF00", "石拐区-#FF0066", "九原区-#33FF00",
    "土默特右旗-#FF0066", "固阳县-#FF0066", "达尔罕茂明安联合旗-#FF0066"
];
var wuhais=[
    "海勃湾区-#33FF00", "海南区-#FF0000", "乌达区-#33FF00"
];
var chifengs=[
    "红山区-#33FF00", "元宝山区-#FF0000", "松山区-#33FF00", "阿鲁科尔沁旗-#FF0066", "巴林左旗-#33FF00",
    "巴林右旗-#FF0066", "林西县-#FF0066", "克什克腾旗-#FF0066", "翁牛特旗-#FF0000","喀喇沁旗-#33FF00", "宁城县-#FF0000",
    "敖汉旗-#33FF00"
];
var tongliaoshis=[
    "科尔沁区-#33FF00", "科尔沁左翼中旗-#FF0000", "科尔沁左翼后旗-#33FF00", "开鲁县-#FF0066", "库伦旗-#33FF00",
    "奈曼旗-#FF0066", "扎鲁特旗-#FF0066"
];
var eerduosishis=[
    "东胜区-#33FF00", "达拉特旗-#FF0000", "准格尔旗-#33FF00", "鄂托克前旗-#FF0066", "鄂托克旗-#33FF00",
    "杭锦旗-#FF0066", "乌审旗-#FF0066", "伊金霍洛旗-#FF0066"
];
var hulunbeiershis=[
    "海拉尔区-#33FF00", "阿荣旗-#FF0000", "鄂伦春自治旗-#33FF00", "鄂温克族自治旗-#FF0066", "陈巴尔虎旗-#33FF00",
    "新巴尔虎左旗-#FF0066", "新巴尔虎右旗-#FF0066"
];
var bayanzhuoershis=[
    "临河区-#33FF00", "五原县-#FF0000", "磴口县-#33FF00", "乌拉特前旗-#FF0066", "乌拉特中旗-#33FF00",
    "乌拉特后旗-#FF0066", "杭锦后旗-#FF0066"
];
var wulanchaershis=[
    "集宁区-#33FF00", "卓资县-#FF0000", "化德县-#33FF00", "商都县-#FF0066", "兴和县-#33FF00",
    "凉城县-#FF0066", "察哈尔右翼前旗-#FF0066", "察哈尔右翼中旗-#FF0066","察哈尔右翼后旗-#33FF00",
    "四子王旗-#FF0000"
];
var xinganmenshis=[
    "兴安盟-#33FF00", "科尔沁右翼前旗-#FF0000", "科尔沁右翼中旗-#33FF00", "扎赉特旗-#FF0066", "突泉县-#33FF00"
];
var xilinguolemens=[
    "锡林郭勒盟-#FF0000","阿巴嘎旗-#33FF00", "苏尼特左旗-#FF0000", "苏尼特右旗-#33FF00", "东乌珠穆沁旗-#FF0066", "西乌珠穆沁旗-#33FF00",
    "太仆寺旗-#FF0066", "镶黄旗-#FF0066","正镶白旗-#33FF00", "正蓝旗-#FF0000", "多伦县-#33FF00"
];
var alashanmens=[
    "阿拉善盟-#33FF00", "阿拉善左旗-#FF0000", "阿拉善右旗-#33FF00", "额济纳旗-#FF0066"
];
var shenyangshis=[
    "和平区-#33FF00", "沈河区-#FF0000", "大东区-#33FF00", "皇姑区-#FF0066", "铁西区-#33FF00",
    "苏家屯区-#FF0066", "东陵区-#FF0066", "新城子区-#FF0066","于洪区-#33FF00","辽中县-#33FF00", "康平县-#FF0000", "法库县-#33FF00"
];
var dalianshis=[
    "中山区-#33FF00", "西岗区-#FF0000", "沙河口区-#33FF00", "甘井子区-#FF0066", "旅顺口区-#33FF00",
    "金州区-#FF0066", "长海县-#FF0066"
];
var anshanshis=[
    "铁东区-#33FF00", "铁西区-#FF0000", "立山区-#33FF00", "千山区-#FF0066", "台安县-#33FF00",
    "岫岩满族自治县-#FF0066"
];
var fushunshis=[
    "新抚区-#33FF00", "东洲区-#FF0000", "望花区-#33FF00", "顺城区-#FF0066", "抚顺县-#33FF00",
    "新宾满族自治县-#FF0066", "清原满族自治县-#FF0066"
];
var benxishis=[
    "平山区-#33FF00", "溪湖区-#FF0000", "明山区-#33FF00", "南芬区-#FF0066", "本溪满族自治县-#33FF00",
    "桓仁满族自治县-#FF0066"
];
var dandongshis=[
    "元宝区-#33FF00", "振兴区-#FF0000", "振安区-#33FF00", "宽甸满族自治县-#FF0066"
];
var jinzhoushis=[
    "古塔区-#33FF00", "凌河区-#FF0000", "太和区-#33FF00", "黑山县-#FF0066", "义县-#33FF00"
];
var yinkoushis=[
    "站前区-#33FF00", "西市区-#FF0000", "鲅鱼圈区-#33FF00", "老边区-#FF0066"
];
var buxishis=[
    "海州区-#33FF00", "太平区-#FF0000", "清河门区-#33FF00", "细河区-#FF0066", "阜新蒙古族自治县-#33FF00",
    "彰武县-#FF0066"
];
var liaoyangshis=[
    "白塔区-#33FF00", "文圣区-#FF0000", "宏伟区-#33FF00", "弓长岭区-#FF0066", "太子河区-#33FF00",
    "辽阳县-#FF0066"
];
var panjinshis=[
    "双台子区-#33FF00", "兴隆台区-#FF0000", "大洼县-#33FF00", "盘山县-#FF0066"
];
var tielingshis=[
    "银州区-#33FF00", "清河区-#FF0000", "铁岭县-#33FF00", "西丰县-#FF0066", "昌图县-#33FF00"
];
var chaoyangshis=[
    "双塔区-#33FF00", "龙城区-#FF0000", "朝阳县-#33FF00", "建平县-#FF0066"
];
var huludaoshis=[
    "连山区-#33FF00", "龙港区-#FF0000", "南票区-#33FF00", "绥中县-#FF0066","建昌县-#33FF00"
];
var changchunshis=[
    "南关区-#33FF00", "宽城区-#FF0000", "朝阳区-#33FF00", "二道区-#FF0066", "绿园区-#33FF00",
    "双阳区-#FF0066","农安县-#FF0000"
];
var jilinshis=[
    "昌邑区-#33FF00", "龙潭区-#FF0000", "船营区-#33FF00", "丰满区-#FF0066", "永吉县-#33FF00"
];
var sipingshis=[
    "铁西区-#33FF00", "铁东区-#FF0000", "梨树县-#33FF00", "伊通满族自治县-#FF0066","公主岭市-#33FF00"
];
var liaoyuanshis=[
    "龙山区-#33FF00", "西安区-#FF0000", "东丰县-#33FF00", "东辽县-#FF0066"
];
var tonghuashis=[
    "东昌区-#33FF00", "二道江区-#FF0000", "通化县-#33FF00", "柳河县-#FF0066"
];
var baishanshis=[
    "八道江区-#33FF00", "抚松县-#FF0000", "靖宇县-#33FF00", "长白朝鲜族自治县-#FF0066"
];
var songyuanshis=[
    "宁江区-#33FF00", "长岭县-#FF0000", "乾安县-#33FF00", "扶余县-#FF0066"
];
var baichengshis=[
    "洮北区-#33FF00", "镇赉县-#FF0000", "通榆县-#33FF00"
];
var yanbianchaoxianzuzizhizhous=[
    "汪清县-#33FF00", "安图县-#FF0000"
];
var haerbinshis=[
    "道里区-#33FF00", "南岗区-#FF0000", "道外区-#33FF00", "香坊区-#FF0066","平房区-#FF0066", "松北区-#FF0000", "呼兰区-#FF0066", "依兰县-#FF0000", "方正县-#FF0066",
    "宾县-#FF0000", "巴彦县-#FF0066", "木兰县-#33FF00", "通河县-#33FF00", "延寿县-#33FF00"
];
var qiqihaershis=[
    "龙沙区-#33FF00", "建华区-#FF0000", "铁锋区-#33FF00", "昂昂溪区-#FF0066","富拉尔基区-#33FF00", "龙江县-#FF0000", "依安县-#33FF00",
    "泰来县-#FF0066","甘南县-#33FF00","富裕县-#33FF00", "克山县-#FF0000", "克东县-#33FF00", "拜泉县-#FF0066"
];
var jixishis=[
    "鸡冠区-#33FF00", "恒山区-#FF0000", "滴道区-#33FF00", "梨树区-#FF0066","城子河区-#FF0066", "麻山区-#FF0000", "鸡东县-#FF0066"
];
var hegangshis=[
    "向阳区-#33FF00", "工农区-#FF0000", "南山区-#33FF00", "兴安区-#FF0066","东山区-#33FF00", "兴山区-#FF0000", "萝北县-#33FF00",
    "绥滨县-#FF0066"
];
var shuangyashanshis=[
    "尖山区-#33FF00", "岭东区-#FF0000", "四方台区-#33FF00", "宝山区-#FF0066","集贤县-#33FF00", "友谊县-#FF0000", "宝清县-#33FF00",
    "饶河县-#FF0066"
];
var daqinshis=[
    "萨尔图区-#33FF00", "龙凤区-#FF0000", "让胡路区-#33FF00", "红岗区-#FF0066","大同区-#FF0066", "肇州县-#FF0000", "肇源县-#FF0066", "林甸县-#FF0000", "杜尔伯特蒙古族自治县-#FF0066"
];
var yichunshis=[
    "南岔区-#33FF00", "友好区-#FF0000", "西林区-#33FF00", "翠峦区-#FF0066","新青区-#33FF00", "美溪区-#FF0000", "金山屯区-#33FF00",
    "五营区-#FF0066","乌马河区-#FF0066", "汤旺河区-#FF0000", "带岭区-#FF0066", "乌伊岭区-#33FF00", "红星区-#FF0000", "上甘岭区-#33FF00", "嘉荫县-#FF0066"
];
var jiamusishis=[
    "向阳区-#33FF00", "前进区-#FF0000", "东风区-#33FF00", "郊区-#FF0066","桦南县-#33FF00", "桦川县-#FF0000", "汤原县-#33FF00",
    "抚远县-#FF0066"
];
var qitaiheshis=[
    "新兴区-#33FF00", "桃山区-#FF0000", "茄子河区-#33FF00", "勃利县-#FF0066"
];
var mudanjiangshis=[
    "东安区-#33FF00", "阳明区-#FF0000", "爱民区-#33FF00", "西安区-#FF0066","东宁县-#33FF00", "林口县-#FF0000"
];
var heiheshis=[
    "爱辉区-#33FF00", "逊克县-#FF0000", "孙吴县-#33FF00"
];
var suihuashis=[
    "北林区-#33FF00", "望奎县-#FF0000", "兰西县-#33FF00", "青冈县-#FF0066","庆安县-#33FF00", "明水县-#FF0000", "绥棱县-#33FF00",
];
var daxinganlings=[
    "呼玛县-#33FF00", "塔河县-#FF0000", "漠河县-#33FF00"
];
var shanghaishis=[
    "黄浦区-#33FF00", "卢湾区-#FF0000", "徐汇区-#33FF00", "长宁区-#FF0066","静安区-#33FF00", "普陀区-#FF0000", "闸北区-#33FF00", "虹口区-#33FF00",
    "杨浦区-#FF0000", "闵行区-#33FF00", "宝山区-#FF0066","嘉定区-#33FF00", "浦东新区-#FF0000", "金山区-#33FF00","松江区-#33FF00", "青浦区-#FF0000",
    "南汇区-#33FF00", "奉贤区-#FF0066","崇明县-#33FF00"
];
var nanjingshis=[
    "玄武区-#33FF00", "白下区-#FF0000", "秦淮区-#33FF00", "建邺区-#FF0066","鼓楼区-#33FF00", "下关区-#FF0000", "浦口区-#33FF00",
    "栖霞区-#FF0066","雨花台区-#FF0066", "江宁区-#FF0000", "六合区-#FF0066", "溧水县-#33FF00", "高淳县-#FF0000"
];
var wuxishis=[
    "崇安区-#33FF00", "南长区-#FF0000", "北塘区-#33FF00", "锡山区-#FF0066","惠山区-#33FF00", "滨湖区-#FF0000"
];
var xuzhoushis=[
    "鼓楼区-#33FF00", "云龙区-#FF0000", "九里区-#33FF00", "贾汪区-#FF0066","泉山区-#33FF00", "丰县-#FF0000", "沛县-#33FF00",
    "铜山县-#FF0066","睢宁县-#FF0066"
];
var changzhoushis=[
    "天宁区-#33FF00", "钟楼区-#FF0000", "戚墅堰区-#33FF00", "新北区-#FF0066","武进区-#33FF00"
];
var suzhoushis=[
    "沧浪区-#33FF00", "平江区-#FF0000", "金阊区-#33FF00", "虎丘区-#FF0066","吴中区-#33FF00", "相城区-#FF0000"
];
var nantongshis=[
    "崇川区-#33FF00", "港闸区-#FF0000", "海安县-#33FF00", "如东县-#FF0066"
];
var lianyungangshis=[
    "连云区-#33FF00", "新浦区-#FF0000", "海州区-#33FF00", "赣榆县-#FF0066","东海县-#33FF00", "灌云县-#FF0000","成都市-#FF0066", "自贡市-#FF0000", "攀枝花市-#FF0066", "泸州市-#FF0000", "德阳市-#FF0066",
    "灌南县-#FF0000"
];
var huaianshis=[
    "清河区-#FF0066", "楚州区-#FF0000", "淮阴区-#FF0066", "清浦区-#FF0000", "涟水县-#FF0066",
    "洪泽县-#FF0000", "盱眙县-#33FF00", "金湖县-#FF0000"
];
var yanchengshis=[
    "亭湖区-#33FF00", "盐都区-#FF0000", "响水县-#33FF00", "滨海县-#FF0066","阜宁县-#33FF00", "射阳县-#FF0000","建湖县-#FF0066"
];
var yangzhoushis=[
    "广陵区-#33FF00", "邗江区-#FF0000", "维扬区-#33FF00"
];
var zhenjiangshis=[
    "京口区-#FF0066", "润州区-#FF0000", "丹徒区-#FF0066", "丹阳市-#FF0000", "扬中市-#FF0066",
    "句容市-#FF0000"
];
var taizhoushis=[
    "兴化市-#FF0066", "靖江市-#FF0000", "泰兴市-#FF0066", "姜堰市-#FF0000"
];
var suqianshis=[
    "宿城区-#33FF00", "宿豫区-#FF0000", "沭阳县-#33FF00", "泗阳县-#FF0066","泗洪县-#33FF00", "射阳县-#FF0000","建湖县-#FF0066"
];
var hangzhoushis=[
    "上城区-#FF0066", "下城区-#FF0000", "江干区-#FF0066", "拱墅区-#FF0000", "西湖区-#FF0066",
    "滨江区-#FF0000","萧山区-#FF0066", "余杭区-#FF0000", "桐庐县-#FF0066", "淳安县-#FF0000", "建德市-#FF0066",
    "富阳市-#FF0000", "临安市-#33FF00"
];
var ningboshis=[
    "海曙区-#FF0066", "江东区-#FF0000", "江北区-#FF0066", "北仑区-#FF0000", "镇海区-#FF0066",
    "鄞州区-#FF0000","象山县-#FF0000","宁海县-#FF0066", "余姚市-#FF0000", "慈溪市-#FF0066", "奉化市-#FF0000"
];
var wenzhoushis=[
    "鹿城区-#FF0066", "龙湾区-#FF0000", "洞头县-#FF0066", "永嘉县-#FF0000", "平阳县-#FF0066",
    "苍南县-#FF0000","文成县-#FF0000","泰顺县-#FF0066", "瑞安市-#FF0000", "乐清市-#FF0066"
];
var jiaxingshis=[
    "秀洲区-#FF0066", "嘉善县-#FF0000", "海盐县-#FF0066", "海宁市-#FF0000", "平湖市-#FF0066",
    "桐乡市-#FF0000"
];
var huzhoushis=[
    "吴兴区-#FF0066", "南浔区-#FF0000", "德清县-#FF0066", "长兴县-#FF0000", "安吉县-#FF0066"
];

var shaoxinshis=[
    "越城区-#FF0066", "绍兴县-#FF0000", "新昌县-#FF0066", "诸暨市-#FF0000", "上虞市-#FF0066",
    "嵊州市-#FF0000"                   ];

var jinhuashis=[
    "婺城区-#FF0066", "金东区-#FF0000", "武义县-#FF0066", "浦江县-#FF0000", "磐安县-#FF0066",
    "兰溪市-#FF0000","义乌市-#FF0066", "东阳市-#FF0000", "永康市-#FF0066"
];
var quzhoushis=[
    "柯城区-#FF0066", "衢江区-#FF0000", "常山县-#FF0066", "开化县-#FF0000", "龙游县-#FF0066",
    "江山市-#FF0000"
];
var zhoushanshis=[
    "定海区-#FF0066", "普陀区-#FF0000", "岱山县-#FF0066", "嵊泗县-#FF0000"
];
var tazhoushis=[
    "椒江区-#FF0066", "黄岩区-#FF0000", "路桥区-#FF0066", "玉环县-#FF0000", "三门县-#FF0066",
    "天台县-#FF0000","仙居县-#FF0066", "温岭市-#FF0000", "临海市-#FF0066"
];
var lishuishis=[
    "莲都区-#FF0066", "青田县-#FF0000", "缙云县-#FF0066", "遂昌县-#FF0000", "松阳县-#FF0066",
    "云和县-#FF0000","庆元县-#FF0066", "景宁畲族自治县-#FF0000", "龙泉市-#FF0066"
];
var hefeishis=[
    "瑶海区-#FF0066", "庐阳区-#FF0000", "蜀山区-#FF0066", "包河区-#FF0000", "长丰县-#FF0066",
    "肥东县-#FF0000","肥西县-#FF0066"
];
var wuhushis=[
    "镜湖区-#FF0066", "鸠江区-#FF0000", "芜湖县-#FF0066", "繁昌县-#FF0000", "南陵县-#FF0066"
];
var bangbushis=[
    "龙子湖区-#FF0066", "蚌山区-#FF0000", "禹会区-#FF0066", "淮上区-#FF0000", "怀远县-#FF0066",
    "五河县-#FF0000","固镇县-#FF0066"
];
var huainanshis=[
    "大通区-#FF0066", "田家庵区-#FF0000", "谢家集区-#FF0066", "八公山区-#FF0000", "潘集区-#FF0066",
    "凤台县-#FF0000"
];
var maanshanshis=[
    "金家庄区-#FF0066", "花山区-#FF0000", "雨山区-#FF0066", "当涂县-#FF0000"
];
var huaibeishis=[
    "杜集区-#FF0066", "相山区-#FF0000", "烈山区-#FF0066", "濉溪县-#FF0000"
];
var tonglinshis=[
    "铜官山区-#FF0066", "狮子山区-#FF0000", "郊区-#FF0066", "铜陵县-#FF0000"
];
var anqinshis=[
    "迎江区-#FF0066", "大观区-#FF0000", "郊区-#FF0066", "怀宁县-#FF0000", "枞阳县-#FF0066",
    "潜山县-#FF0066", "太湖县-#FF0000", "宿松县-#FF0066", "望江县-#FF0000", "岳西县-#FF0066",
    "桐城市-#FF0000"
];
var huangshanshis=[
    "屯溪区-#FF0066", "黄山区-#FF0000", "徽州区-#FF0066", "歙县-#FF0000", "休宁县-#FF0066",
    "黟县-#FF0000","祁门县-#FF0066"
];
var xuzhoushis=[
    "琅琊区-#FF0066", "南谯区-#FF0000", "来安县-#FF0066", "全椒县-#FF0000", "定远县-#FF0066",
    "凤阳县-#FF0000","天长市-#FF0000","明光市-#FF0066"
];
var buyangshis=[
    "颍州区-#FF0066", "颍东区-#FF0000", "颍泉区-#FF0066", "临泉县-#FF0000", "太和县-#FF0066",
    "阜南县-#FF0066", "颍上县-#FF0000"
];
var suzhousshis=[
    "埇桥区-#FF0066", "砀山县-#FF0000", "萧县-#FF0066", "灵璧县-#FF0000", "泗县-#FF0066"
];
var chaohushis=[
    "居巢区-#FF0066", "庐江县-#FF0000", "无为县-#FF0066", "含山县-#FF0000", "和县-#FF0066"
];
var liuanshis=[
    "金安区-#FF0066", "裕安区-#FF0000", "寿县-#FF0066", "霍邱县-#FF0000","舒城县-#FF0066",
    "金寨县-#FF0066", "霍山县-#FF0000"
];
var haozhoushis=[
    "谯城区-#FF0066", "涡阳县-#FF0000", "蒙城县-#FF0066", "利辛县-#FF0000"
];
var chizhoushis=[
    "贵池区-#FF0066", "东至县-#FF0000", "石台县-#FF0066", "青阳县-#FF0000"
];
var xuanchengshis=[
    "宣州区-#FF0066", "郎溪县-#FF0000", "广德县-#FF0066", "泾县-#FF0000","绩溪县-#FF0066",
    "旌德县-#FF0066", "宁国市-#FF0000"
];
var fuzhoushis=[
    "鼓楼区-#FF0066", "台江区-#FF0000", "仓山区-#FF0066", "马尾区-#FF0000","晋安区-#FF0066",
    "闽侯县-#FF0066", "连江县-#FF0000","罗源县-#FF0066", "闽清县-#FF0000", "永泰县-#FF0066", "平潭县-#FF0000",
    "福清市-#FF0000", "长乐市-#FF0066"
];
var xiamenshis=[
    "思明区-#FF0066", "海沧区-#FF0000", "湖里区-#FF0066", "集美区-#FF0000", "同安区-#FF0066",
    "翔安区-#FF0066"
];
var putianshis=[
    "城厢区-#FF0066", "涵江区-#FF0000", "荔城区-#FF0066", "秀屿区-#FF0000","仙游县-#FF0066"
];
var sanmingshis=[
    "梅列区-#FF0066", "三元区-#FF0000", "明溪县-#FF0066", "清流县-#FF0000","宁化县-#FF0066",
    "大田县-#FF0066", "尤溪县-#FF0000","沙县-#FF0066", "将乐县-#FF0000", "泰宁县-#FF0066", "建宁县-#FF0000",
    "永安市-#FF0000"
];
var quanzhoushis=[
    "鲤城区-#FF0066", "丰泽区-#FF0000", "洛江区-#FF0066", "泉港区-#FF0000", "惠安县-#FF0066",
    "安溪县-#FF0066", "永春县-#FF0066", "德化县-#FF0000", "金门县-#FF0066", "石狮市-#FF0000","晋江市-#FF0066",
    "南安市-#FF0066"
];
var zhangzhoushis=[
    "芗城区-#FF0066", "龙文区-#FF0000", "云霄县-#FF0066", "漳浦县-#FF0000","诏安县-#FF0066",
    "长泰县-#FF0066", "东山县-#FF0000","南靖县-#FF0066", "平和县-#FF0000", "华安县-#FF0066", "龙海市-#FF0000"
];
var nanpingshis=[
    "延平区-#FF0066", "顺昌县-#FF0000", "浦城县-#FF0066", "光泽县-#FF0000", "松溪县-#FF0066",
    "政和县-#FF0066", "邵武市-#FF0000", "武夷山市-#FF0066", "建瓯市-#FF0000", "建阳市-#FF0066"
];
var longyanshis=[
    "新罗区-#FF0066", "长汀县-#FF0000", "永定县-#FF0066", "上杭县-#FF0000", "武平县-#FF0066",
    "连城县-#FF0066", "漳平市-#FF0066"
];
var ningdeshis=[
    "蕉城区-#FF0066", "霞浦县-#FF0000", "古田县-#FF0066", "屏南县-#FF0000","寿宁县-#FF0066",
    "周宁县-#FF0066", "柘荣县-#FF0000","福安市-#FF0066", "福鼎市-#FF0000"
];
var nanchangshis=[
    "东湖区-#FF0066", "西湖区-#FF0000", "青云谱区-#FF0066", "湾里区-#FF0000", "青山湖区-#FF0066",
    "南昌县-#FF0066", "新建县-#FF0000", "安义县-#FF0066", "进贤县-#FF0000"
];
var jingdezhenshis=[
    "昌江区-#FF0066", "珠山区-#FF0000", "浮梁县-#FF0066", "乐平市-#FF0000"
];
var pingxiangshis=[
    "安源区-#FF0066", "湘东区-#FF0000", "莲花县-#FF0066", "上栗县-#FF0000","芦溪县-#FF0066"
];
var jiujiangshis=[
    "庐山区-#FF0066", "浔阳区-#FF0000", "九江县-#FF0066", "武宁县-#FF0000", "修水县-#FF0066",
    "永修县-#FF0066", "德安县-#FF0000", "星子县-#FF0066", "都昌县-#FF0000","湖口县-#FF0066",
    "彭泽县-#FF0066", "瑞昌市-#FF0000"
];
var xinyushis=[
    "渝水区-#FF0066", "渝水区-#FF0000"
];
var yintanshis=[
    "月湖区-#FF0066", "余江县-#FF0000", "贵溪市-#FF0066"
];
var ganzhoushis=[
    "章贡区-#FF0066", "赣县-#FF0000", "信丰县-#FF0066", "大余县-#FF0000", "上犹县-#FF0066",
    "崇义县-#FF0066", "安远县-#FF0000", "龙南县-#FF0066", "定南县-#FF0000","全南县-#FF0066", "宁都县-#FF0000", "于都县-#FF0066", "都昌县-#FF0000","湖口县-#FF0066",
    "兴国县-#FF0066", "会昌县-#FF0000","寻乌县-#FF0066", "石城县-#FF0000", "瑞金市-#FF0066", "南康市-#FF0000"
];
var jianshis=[
    "吉州区-#FF0066", "青原区-#FF0000", "吉安县-#FF0066", "吉水县-#FF0000", "峡江县-#FF0066",
    "新干县-#FF0066", "永丰县-#FF0000", "泰和县-#FF0066", "遂川县-#FF0000","万安县-#FF0066",
    "安福县-#FF0066", "永新县-#FF0000", "井冈山市-#FF0066"
];
var yichongshis=[
    "袁州区-#FF0066", "奉新县-#FF0000", "万载县-#FF0066", "上高县-#FF0000", "宜丰县-#FF0066",
    "靖安县-#FF0066", "铜鼓县-#FF0000", "丰城市-#FF0066", "樟树市-#FF0000","高安市-#FF0066"
];
var wuzhoushis=[
    "临川区-#FF0066", "南城县-#FF0000", "黎川县-#FF0066", "南丰县-#FF0000", "崇仁县-#FF0066",
    "乐安县-#FF0066", "宜黄县-#FF0000", "金溪县-#FF0066", "资溪县-#FF0000","东乡县-#FF0066",
    "广昌县-#FF0066"
];
var shangraoshis=[
    "信州区-#FF0066", "上饶县-#FF0000", "广丰县-#FF0066", "玉山县-#FF0000", "铅山县-#FF0066",
    "横峰县-#FF0066", "弋阳县-#FF0000", "余干县-#FF0066", "鄱阳县-#FF0000","万年县-#FF0066", "婺源县-#FF0000", "德兴市-#FF0066"
];
var jinanshis=[
    "历下区-#FF0066", "市中区-#FF0000", "槐荫区-#FF0066", "天桥区-#FF0000", "历城区-#FF0066",
    "长清区-#FF0066", "平阴县-#FF0000", "济阳县-#FF0066", "商河县-#FF0000","章丘市-#FF0066"
];
var qindaoshis=[
    "市南区-#FF0066", "市北区-#FF0000", "四方区-#FF0066", "黄岛区-#FF0000", "崂山区-#FF0066",
    "李沧区-#FF0066", "城阳区-#FF0000", "胶州市-#FF0066", "即墨市-#FF0000","平度市-#FF0066",
    "胶南市-#FF0066", "莱西市-#FF0000"
];
var ziboshis=[
    "张店区-#FF0066", "博山区-#FF0000", "临淄区-#FF0066", "周村区-#FF0000", "桓台县-#FF0066",
    "高青县-#FF0066", "沂源县-#FF0000"
];
var zaozhuangshis=[
    "市中区-#FF0066", "薛城区-#FF0000", "峄城区-#FF0066", "台儿庄区-#FF0000", "山亭区-#FF0066",
    "滕州市-#FF0066"
];
var dongyinshis=[
    "东营区-#FF0066", "河口区-#FF0000", "垦利县-#FF0066", "利津县-#FF0000", "广饶县-#FF0066"
];
var yantaishis=[
    "芝罘区-#FF0066", "福山区-#FF0000", "牟平区-#FF0066", "莱山区-#FF0000", "长岛县-#FF0066",
    "龙口市-#FF0066", "莱阳市-#FF0000","莱州市-#FF0066", "蓬莱市-#FF0000", "招远市-#FF0066", "栖霞市-#FF0000", "海阳市-#FF0066"
];
var weifangshis=[
    "潍城区-#FF0066", "寒亭区-#FF0000", "坊子区-#FF0066", "奎文区-#FF0000", "临朐县-#FF0066",
    "昌乐县-#FF0066", "青州市-#FF0066", "诸城市-#FF0000", "寿光市-#FF0066", "安丘市-#FF0000",
    "高密市-#FF0066", "昌邑市-#FF0000"
];
var jiningshis=[
    "市中区-#FF0066", "任城区-#FF0000", "微山县-#FF0066", "鱼台县-#FF0000", "金乡县-#FF0066",
    "嘉祥县-#FF0066","汶上县-#FF0066", "泗水县-#FF0000", "梁山县-#FF0066", "曲阜市-#FF0000", "兖州市-#FF0066",
    "邹城市-#FF0066"
];
var qinanshis=[
    "泰山区-#FF0066", "岱岳区-#FF0000", "宁阳县-#FF0066", "东平县-#FF0000", "新泰市-#FF0066",
    "肥城市-#FF0066"
];
var weihaishis=[
    "环翠区-#FF0066", "文登市-#FF0000", "荣成市-#FF0066", "乳山市-#FF0000"
];
var rizhaoshis=[
    "东港区-#FF0066", "岚山区-#FF0000", "五莲县-#FF0066", "莒县-#FF0000"
];
var laiwushis=[
    "莱城区-#FF0066", "钢城区-#FF0000"
];
var linxishis=[
    "兰山区-#FF0066", "罗庄区-#FF0000", "河东区-#FF0066", "沂南县-#FF0000", "郯城县-#FF0066",
    "沂水县-#FF0066",  "苍山县-#FF0066", "费县-#FF0000", "平邑县-#FF0066", "莒南县-#FF0000", "金乡县-#FF0066",
    "蒙阴县-#FF0066","临沭县-#FF0066"
];
var dezhoushis=[
    "德城区-#FF0066", "陵县-#FF0000", "宁津县-#FF0066", "庆云县-#FF0000", "临邑县-#FF0066",
    "齐河县-#FF0066","平原县-#FF0066", "夏津县-#FF0000", "武城县-#FF0066", "乐陵市-#FF0000", "兖州市-#FF0066",
    "禹城市-#FF0066"
];
var liaochengshis=[
    "东昌府区-#FF0066", "阳谷县-#FF0000", "莘县-#FF0066", "茌平县-#FF0000", "东阿县-#FF0066",
    "冠县-#FF0066","高唐县-#FF0066","临清市-#FF0066"
];

var binzhoushis=[
    "滨城区-#FF0066", "惠民县-#FF0000", "阳信县-#FF0066", "无棣县-#FF0000", "沾化县-#FF0066",
    "博兴县-#FF0066","邹平县-#FF0066"
];
var mudanshis=[
    "曹县-#FF0066", "单县-#FF0000", "成武县-#FF0066", "巨野县-#FF0000", "郓城县-#FF0066",
    "鄄城县-#FF0066","定陶县-#FF0066", "东明县-#FF0000"
];
var zhenzhoushis=[
    "中原区-#FF0066", "二七区-#FF0000", "管城回族区-#FF0066", "金水区-#FF0000", "上街区-#FF0066",
    "惠济区-#FF0066","中牟县-#FF0066","巩义市-#FF0066", "荥阳市-#FF0000", "新密市-#FF0066", "新郑市-#FF0000", "登封市-#FF0066"
];
var kaifenshis=[
    "龙亭区-#FF0066", "顺河回族区-#FF0000", "鼓楼区-#FF0066", "杞县-#FF0000", "通许县-#FF0066",
    "尉氏县-#FF0066","开封县-#FF0066", "兰考县-#FF0000"
];
var luoyangshis=[
    "老城区-#FF0066", "西工区-#FF0000", "涧西区-#FF0066", "吉利区-#FF0000", "洛龙区-#FF0066",
    "孟津县-#FF0066","新安县-#FF0066", "栾川县-#FF0000","嵩县-#FF0066", "汝阳县-#FF0000", "宜阳县-#FF0066", "洛宁县-#FF0000", "伊川县-#FF0066",
    "偃师市-#FF0066"
];
var pingdingshanshis=[
    "新华区-#FF0066", "卫东区-#FF0000", "石龙区-#FF0066", "湛河区-#FF0000", "宝丰县-#FF0066",
    "叶县-#FF0066","鲁山县-#FF0066", "郏县-#FF0000","舞钢市-#FF0066", "汝州市-#FF0000"
];
var anyangshis=[
    "文峰区-#FF0066", "北关区-#FF0000", "殷都区-#FF0066", "龙安区-#FF0000", "安阳县-#FF0066",
    "汤阴县-#FF0066","滑县-#FF0066", "内黄县-#FF0000","林州市-#FF0066"
];
var hebishis=[
    "鹤山区-#FF0066", "山城区-#FF0000", "淇滨区-#FF0066", "浚县-#FF0000", "淇县-#FF0066"
];
var xinxiangshis=[
    "红旗区-#FF0066", "卫滨区-#FF0000", "凤泉区-#FF0066", "新乡县-#FF0000", "获嘉县-#FF0066",
    "原阳县-#FF0066","延津县-#FF0066", "封丘县-#FF0000","长垣县-#FF0066","卫辉市-#FF0066", "辉县市-#FF0000"
];
var jiaozuoshis=[
    "解放区-#FF0066", "中站区-#FF0000", "马村区-#FF0066", "山阳区-#FF0000", "修武县-#FF0066",
    "博爱县-#FF0066","武陟县-#FF0066", "温县-#FF0000","济源市-#FF0066","沁阳市-#FF0066", "孟州市-#FF0000"
];
var puyangshis=[
    "华龙区-#FF0066", "清丰县-#FF0000", "南乐县-#FF0066", "范县-#FF0000", "台前县-#FF0066","濮阳县-#FF0000"
];
var xuchangshis=[
    "魏都区-#FF0066", "许昌县-#FF0000", "鄢陵县-#FF0066", "襄城县-#FF0000", "禹州市-#FF0066",
    "长葛市-#FF0066"
];
var luheshis=[
    "郾城区-#FF0066", "召陵区-#FF0000", "舞阳县-#FF0066", "临颍县-#FF0000"
];
var sanmenxiashis=[
    "湖滨区-#FF0066", "渑池县-#FF0000", "陕县-#FF0066", "卢氏县-#FF0000", "义马市-#FF0066","灵宝市-#FF0000"
];
var nanyangshis=[
    "宛城区-#FF0066", "卧龙区-#FF0000", "南召县-#FF0066", "方城县-#FF0000", "西峡县-#FF0066",
    "镇平县-#FF0066","内乡县-#FF0066", "淅川县-#FF0000","社旗县-#FF0066","唐河县-#FF0066", "新野县-#FF0000"
    ,"桐柏县-#FF0066", "邓州市-#FF0000"
];
var shangqiushis=[
    "梁园区-#FF0066", "睢阳区-#FF0000", "民权县-#FF0066", "睢县-#FF0000", "宁陵县-#FF0066",
    "柘城县-#FF0066", "虞城县-#FF0066", "夏邑县-#FF0000", "永城市-#FF0066"
];
var xinyanghis=[
    "浉河区-#FF0066", "平桥区-#FF0000", "罗山县-#FF0066", "光山县-#FF0000", "新县-#FF0066",
    "商城县-#FF0066","固始县-#FF0066", "潢川县-#FF0000", "淮滨县-#FF0066", "息县-#FF0000"
];
var zhoukoushis=[
    "扶沟县-#FF0066", "西华县-#FF0000", "商水县-#FF0066", "沈丘县-#FF0000", "郸城县-#FF0066",
    "淮阳县-#FF0066","太康县-#FF0066", "鹿邑县-#FF0000","项城市-#FF0066"
];
var zhumadianshis=[
    "驿城区-#FF0066", "西平县-#FF0000", "上蔡县-#FF0066", "平舆县-#FF0000", "正阳县-#FF0066",
    "确山县-#FF0066", "泌阳县-#FF0066", "汝南县-#FF0000", "遂平县-#FF0066", "新蔡县-#FF0000"
];
var wuhanshis=[
    "江岸区-#FF0066", "江汉区-#FF0000", "硚口区-#FF0066", "汉阳区-#FF0000", "武昌区-#FF0066",
    "青山区-#FF0066","洪山区-#FF0066", "东西湖区-#FF0000","汉南区-#FF0066","蔡甸区-#FF0066", "江夏区-#FF0000"
    ,"黄陂区-#FF0066", "新洲区-#FF0000"
];
var huangshishis=[
    "黄石港区-#FF0066", "西塞山区-#FF0000", "下陆区-#FF0066", "铁山区-#FF0000", "阳新县-#FF0066",
    "大冶市-#FF0066"
];
var shiyanshis=[
    "茅箭区-#FF0066", "张湾区-#FF0000", "郧县-#FF0066", "郧西县-#FF0000", "竹山县-#FF0066",
    "竹溪县-#FF0066","房县-#FF0066", "丹江口市-#FF0000"
];
var yichangshis=[
    "西陵区-#FF0066", "伍家岗区-#FF0000", "点军区-#FF0066", "猇亭区-#FF0000", "夷陵区-#FF0066",
    "远安县-#FF0066","兴山县-#FF0066", "秭归县-#FF0000","长阳土家族自治县-#FF0066","五峰土家族自治县-#FF0066", "宜都市-#FF0000"
    ,"当阳市-#FF0066", "枝江市-#FF0000"
];
var xiangfanshis=[
    "襄城区-#FF0066", "樊城区-#FF0000", "襄阳区-#FF0066", "南漳县-#FF0000", "谷城县-#FF0066",
    "保康县-#FF0066","老河口市-#FF0066", "枣阳市-#FF0000","宜城市-#FF0066"
];
var ezhoushis=[
    "梁子湖区-#FF0066", "华容区-#FF0000", "鄂城区-#FF0066"
];
var jinmenshis=[
    "东宝区-#FF0066", "掇刀区-#FF0000", "京山县-#FF0066", "沙洋县-#FF0000", "钟祥市-#FF0066"
];
var xiaoganshis=[
    "孝南区-#FF0066", "孝昌县-#FF0000", "大悟县-#FF0066", "云梦县-#FF0000", "应城市-#FF0066",
    "安陆市-#FF0066","汉川市-#FF0066"
];
var jinzhoushis=[
    "沙市区-#FF0066", "荆州区-#FF0000", "公安县-#FF0066", "监利县-#FF0000", "江陵县-#FF0066",
    "石首市-#FF0066","洪湖市-#FF0066", "松滋市-#FF0000"
];
var huanggangshis=[
    "黄州区-#FF0066", "团风县-#FF0000", "红安县-#FF0066", "罗田县-#FF0000", "英山县-#FF0066",
    "浠水县-#FF0066","蕲春县-#FF0066", "黄梅县-#FF0000","麻城市-#FF0066", "武穴市-#FF0066"
];
var xianningshis=[
    "咸安区-#FF0066", "嘉鱼县-#FF0000", "通城县-#FF0066", "崇阳县-#FF0000", "通山县-#FF0066",
    "赤壁市-#FF0066"
];
var suizhoushis=[
    "曾都区-#FF0066", "广水市-#FF0000"
];
var enhitujiamiaozuzizhizhous=[
    "恩施市-#FF0066", "利川市-#FF0000", "建始县-#FF0066", "巴东县-#FF0000", "宣恩县-#FF0066",
    "咸丰县-#FF0066","来凤县-#FF0066", "鹤峰县-#FF0000"
];
var xiantaoshis=[
    "潜江市-#FF0066", "天门市-#FF0000","神农架林区-#FF0066"
];
var changshashis=[
    "芙蓉区-#FF0066", "天心区-#FF0000", "岳麓区-#FF0066", "开福区-#FF0000", "雨花区-#FF0066",
    "长沙县-#FF0066","望城县-#FF0066", "宁乡县-#FF0000","浏阳市-#FF0066"
];
var zhuzhoushis=[
    "荷塘区-#FF0066", "芦淞区-#FF0000", "石峰区-#FF0066", "天元区-#FF0000", "宣恩县-#FF0066",
    "株洲县-#FF0066","攸县-#FF0066", "茶陵县-#FF0000", "炎陵县-#FF0066", "醴陵市-#FF0000"
];
var xiangtanshis=[
    "雨湖区-#FF0066", "岳塘区-#FF0000", "湘潭县-#FF0066", "湘乡市-#FF0000", "韶山市-#FF0066"
];
var hengyangshis=[
    "珠晖区-#FF0066", "雁峰区-#FF0000", "石鼓区-#FF0066", "蒸湘区-#FF0000", "南岳区-#FF0066",
    "衡阳县-#FF0066","衡南县-#FF0066", "衡山县-#FF0000","衡东县-#FF0066","祁东县-#FF0066", "耒阳市-#FF0000", "常宁市-#FF0066"
];
var shaoyangshis=[
    "双清区-#FF0066", "大祥区-#FF0000", "北塔区-#FF0066", "邵东县-#FF0000", "新邵县-#FF0066",
    "邵阳县-#FF0066","隆回县-#FF0066", "洞口县-#FF0000", "绥宁县-#FF0066", "新宁县-#FF0000",
    "城步苗族自治县-#FF0066", "武冈市-#FF0000"
];
var yueyangshis=[
    "岳阳楼区-#FF0066", "云溪区-#FF0000", "君山区-#FF0066", "岳阳县-#FF0000", "华容县-#FF0066",
    "湘阴县-#FF0066","平江县-#FF0066", "汨罗市-#FF0000", "临湘市-#FF0066"
];
var changdeshis=[
    "武陵区-#FF0066", "鼎城区-#FF0000", "安乡县-#FF0066", "汉寿县-#FF0000", "澧县-#FF0066",
    "临澧县-#FF0066","桃源县-#FF0066", "津市市-#FF0000"
];
var zhangjiajieshis=[
    "永定区-#FF0066", "武陵源区-#FF0000", "慈利县-#FF0066", "桑植县-#FF0000"
];
var yiyangshis=[
    "资阳区-#FF0066", "赫山区-#FF0000", "南县-#FF0066", "桃江县-#FF0000", "安化县-#FF0066",
    "沅江市-#FF0066"
];
var binzhoushis=[
    "北湖区-#FF0066", "苏仙区-#FF0000", "桂阳县-#FF0066", "宜章县-#FF0000", "永兴县-#FF0066",
    "嘉禾县-#FF0066","临武县-#FF0066", "汝城县-#FF0000","桂东县-#FF0066", "安仁县-#FF0000",
    "资兴市-#FF0066"
];
var yongzhoushis=[
    "冷水滩区-#FF0066", "祁阳县-#FF0000", "东安县-#FF0066", "双牌县-#FF0000","道县-#FF0066", "江永县-#FF0000", "宁远县-#FF0066", "蓝山县-#FF0000", "新田县-#FF0066",
    "江华瑶族自治县-#FF0066"
];
var huaihuashis=[
    "鹤城区-#FF0066", "中方县-#FF0000", "沅陵县-#FF0066", "辰溪县-#FF0000", "溆浦县-#FF0066",
    "会同县-#FF0066","麻阳苗族自治县-#FF0066", "新晃侗族自治县-#FF0000","芷江侗族自治县-#FF0066", "靖州苗族侗族自治县-#FF0000", "通道侗族自治县-#FF0066", "洪江市-#FF0000"
];
var loudishis=[
    "娄星区-#FF0066", "双峰县-#FF0000", "新化县-#FF0066", "冷水江市-#FF0000", "涟源市-#FF0066"
];
var xiangxitujiazumiaozuzizhizhous=[
    "吉首市-#FF0066", "泸溪县-#FF0000", "凤凰县-#FF0066", "花垣县-#FF0000","保靖县-#FF0066", "古丈县-#FF0000", "永顺县-#FF0066", "龙山县-#FF0000"
];
var guangzhoushis=[
    "荔湾区-#FF0066", "越秀区-#FF0000", "海珠区-#FF0066", "天河区-#FF0000","白云区-#FF0066", "黄埔区-	#FF0000", "番禺区-#FF0066", "花都区-#FF0000", "增城市-#FF0066",
    "从化市-#FF0066"
];
var shaoguanshis=[
    "武江区-#FF0066", "浈江区-#FF0000", "曲江区-#FF0066", "始兴县-#FF0000", "仁化县-#FF0066",
    "翁源县-#FF0066","乳源瑶族自治县-#FF0066", "新丰县-#FF0000","乐昌市-#FF0066", "南雄市-#FF0000"
];
var shenzhenshis=[
    "罗湖区-#FF0066", "福田区-#FF0000", "南山区-#FF0066", "宝安区-#FF0000","龙岗区-#FF0066", "黄埔区-	#FF0000", "番禺区-#FF0066", "花都区-#FF0000", "增城市-#FF0066",
    "盐田区-#FF0066"
];
var zhuhaishis=[
    "香洲区-#FF0066", "斗门区-#FF0000", "金湾区-#FF0066"
];
var shantoushis=[
    "龙湖区-#FF0066", "金平区-#FF0000", "潮阳区-#FF0066", "潮南区-#FF0000", "澄海区-#FF0066",
    "南澳县-#FF0066"
];
var foshanshis=[
    "南海区-#FF0066", "顺德区-#FF0000", "三水区-#FF0066", "高明区-#FF0000"
];
var jiangmenshis=[
    "新会区-#FF0066", "台山市-#FF0000", "开平市-#FF0066", "鹤山市-#FF0000","恩平市-#FF0066"
];
var zhanjiangshis=[
    "赤坎区-#FF0066", "霞山区-#FF0000", "坡头区-#FF0066", "麻章区-#FF0000", "遂溪县-#FF0066",
    "徐闻县-#FF0066","廉江市-#FF0066", "雷州市-#FF0000", "吴川市-#FF0066"
];
var maomingshis=[
    "茂南区-#FF0066", "茂港区-#FF0000", "电白县-#FF0066", "高州市-#FF0000","化州市-#FF0066",
    "信宜市-#FF0066"
];
var zhaoqinshis=[
    "端州区-#FF0066", "鼎湖区-#FF0000", "广宁县-#FF0066", "怀集县-#FF0000", "封开县-#FF0066",
    "德庆县-#FF0066","高要市-#FF0066", "四会市-#FF0000"
];
var huizhoushis=[
    "惠城区-#FF0066", "惠阳区-#FF0000", "博罗县-#FF0066", "惠东县-#FF0000","龙门县-#FF0066"
];
var meizhoushis=[
    "梅江区-#FF0066", "梅县-#FF0000", "大埔县-#FF0066", "丰顺县-#FF0000", "五华县-#FF0066",
    "平远县-#FF0066","蕉岭县-#FF0066", "兴宁市-#FF0000"
];
var shanweishis=[
    "海丰县-#FF0066", "陆河县-#FF0000", "陆丰市-#FF0066"
];
var heyuanshis=[
    "源城区-#FF0066", "紫金县-#FF0000", "龙川县-#FF0066", "连平县-#FF0000", "和平县-#FF0066",
    "东源县-#FF0066"
];
var yangjiangshis=[
    "江城区-#FF0066", "阳西县-#FF0000", "阳东县-#FF0066", "阳春市-#FF0000"
];
var qingyuanshis=[
    "清城区-#FF0066", "佛冈县-#FF0000", "阳山县-#FF0066", "连山壮族瑶族自治县-#FF0000", "连南瑶族自治县-#FF0066",
    "清新县-#FF0066","英德市-#FF0066", "连州市-#FF0000"
];
var dongguanshis=[
    "东莞市-#FF0066"
];
var zhongshanshis=[
    "中山市-#FF0066"
];
var chaozhoushis=[
    "湘桥区-#FF0066", "潮安县-#FF0000", "饶平县-#FF0066"
];
var jieyangshis=[
    "揭东县-#FF0066", "揭西县-#FF0000", "惠来县-#FF0066", "普宁市-#FF0000"
];
var yunfushis=[
    "云城区-#FF0066", "新兴县-#FF0000", "郁南县-#FF0066", "云安县-#FF0000", "罗定市-#FF0066"
];
var nanningshis=[
    "兴宁区-#FF0066", "江南区-#FF0000", "西乡塘区-#FF0066", "良庆区-#FF0000", "邕宁区-#FF0066",
    "武鸣县-#FF0066","隆安县-#FF0066", "马山县-#FF0000","上林县-#FF0066", "宾阳县-#FF0000", "横县-#FF0066"
];
var liuzhoushis=[
    "柳南区-#FF0066", "柳江县-#FF0000", "柳城县-#FF0066", "鹿寨县-#FF0000", "融安县-#FF0066",
    "融水苗族自治县-#FF0066","三江侗族自治县-#FF0066"
];
var guilinshis=[
    "阳朔县-#FF0066", "临桂县-#FF0000", "灵川县-#FF0066", "全州县-#FF0000", "兴安县-#FF0066",
    "永福县-#FF0066","灌阳县-#FF0066", "龙胜各族自治县-#FF0000","资源县-#FF0066", "平乐县-#FF0000",
    "恭城瑶族自治县-#FF0066"
];
var wuzhoushis=[
    "苍梧县-#FF0066", "藤县-#FF0000", "蒙山县-#FF0066", "岑溪市-#FF0000"
];
var beihaishis=[
    "铁山港区-#FF0066", "合浦县-#FF0000"
];
var fangchenggangshis=[
    "港口区-#FF0066", "防城区-#FF0000", "上思县-#FF0066", "东兴市-#FF0000"
];
var qinzhoushis=[
    "钦北区-#FF0066", "灵山县-#FF0000", "浦北县-#FF0066"
];
var guigangshis=[
    "覃塘区-#FF0066", "平南县-#FF0000", "桂平市-#FF0066"
];
var yulinshis=[
    "容县-#FF0066", "陆川县-#FF0000", "博白县-#FF0066", "兴业县-#FF0000","北流市-#FF0066"
];
var baiseshis=[
    "田阳县-#FF0066", "田东县-#FF0000", "平果县-#FF0066", "德保县-#FF0000", "靖西县-#FF0066",
    "那坡县-#FF0066","凌云县-#FF0066", "乐业县-#FF0000","田林县-#FF0066", "西林县-#FF0000",
    "隆林各族自治县-#FF0066"
];
var hezhoushis=[
    "昭平县-#FF0066", "钟山县-#FF0000", "富川瑶族自治县-#FF0066"
];
var hechishis=[
    "金城江区-#FF0066", "南丹县-#FF0000", "天峨县-#FF0066", "凤山县-#FF0000", "东兰县-#FF0066",
    "罗城仫佬族自治县-#FF0066","环江毛南族自治县-#FF0066", "巴马瑶族自治县-#FF0000","都安瑶族自治县-#FF0066", "大化瑶族自治县-#FF0000",
    "宜州市-#FF0066"
];
var laibinshis=[
    "忻城县-#FF0066", "象州县-#FF0000", "武宣县-#FF0066", "金秀瑶族自治县-#FF0000","合山市-#FF0066"
];
var chongzuoshis=[
    "田阳县-#FF0066", "田东县-#FF0000", "平果县-#FF0066", "德保县-#FF0000", "靖西县-#FF0066",
    "那坡县-#FF0066","凌云县-#FF0066", "乐业县-#FF0000","田林县-#FF0066", "西林县-#FF0000",
    "隆林各族自治县-#FF0066"
];
var haikoushis=[
    "秀英区-#FF0066", "龙华区-#FF0000", "琼山区-#FF0066", "美兰区-#FF0000"
];
var sanyashis=[
    "三亚市-#FF0066"
];

var wuzhishanshis=[
    "五指山市-#FF0066", "琼海市-#FF0000", "儋州市-#FF0066", "文昌市-#FF0000", "万宁市-#FF0066",
    "东方市-#FF0066","凌云县-#FF0066", "屯昌县-#FF0000","澄迈县-#FF0066", "临高县-#FF0000",
    "白沙黎族自治县-#FF0066","昌江黎族自治县-#FF0066", "乐东黎族自治县-#FF0000", "陵水黎族自治县-#FF0066",
    "保亭黎族苗族自治县-#FF0066","琼中黎族苗族自治县-#FF0066"
];
var chongqinshis=[
    "万州区-#FF0066", "涪陵区-#FF0000", "渝中区-#FF0066", "大渡口区-#FF0000", "江北区-#FF0066",
    "沙坪坝区-#FF0000", "九龙坡区-#FF0066", "南岸区-#33FF00", "北碚区-#33FF00", "万盛区-#33FF00", "双桥区-#FF0000",
    "渝北区-#FF0066", "巴南区-#FF0000", "黔江区-#33FF00","长寿区-#FF0066", "綦江县-#FF0066", "潼南县-#FF0066",
    "铜梁县-#FF0000", "大足县-#FF0000", "璧山县-#FF0066", "梁平县-#FF0000", "城口县-#FF0066", "丰都县-#FF0000",
    "垫江县-#33FF00","武隆县-#FF0066","忠县-#33FF00","开县-#FF0066","云阳县-#FF0066", "奉节县-#FF0000", "巫山县-#FF0066",
    "巫溪县-#FF0066","石柱土家族自治县-#FF0066","秀山土家族苗族自治县-#FF0066","酉阳土家族苗族自治县-#FF0066", "彭水苗族土家族自治县-#FF0000"
];
var chengdushis=[
    "锦江区-#FF0066", "青羊区-#FF0000", "金牛区-#FF0066", "武侯区-#FF0000", "成华区-#FF0066",
    "龙泉驿区-#FF0066","青白江区-#FF0066", "新都区-#FF0000","温江区-#FF0066", "金堂县-#FF0000",
    "双流县-#FF0066","郫县-#FF0066", "大邑县-#FF0000", "蒲江县-#33FF00","新津县-#FF0066", "都江堰市-#FF0066", "彭州市-#FF0066",
    "邛崃市-#FF0000", "崇州市-#FF0000"
];
var zigongshis=[
    "自流井区-#FF0066", "贡井区-#FF0000", "大安区-#FF0066", "沿滩区-#FF0000", "荣县-#FF0066",
    "富顺县-#FF0066"
];
var panzhihuashis=[
    "东区-#FF0066", "西区-#FF0000", "仁和区-#33FF00","米易县-#FF0066","盐边县-#33FF00"
];
var luzhoushis=[
    "江阳区-#FF0066", "纳溪区-#FF0000", "龙马潭区-#FF0066", "泸县-#FF0000", "合江县-#FF0066",
    "叙永县-#FF0000", "古蔺县-#33FF00"
];
var deyangshis=[
    "旌阳区-#FF0000", "中江县-#FF0000", "罗江县-#FF0000", "广汉市-#FF0066", "什邡市-#FF0066",
    "绵竹市-#FF0066"
];
var mianyangshis=[
    "涪城区-#FF0000", "游仙区-#FF0066", "三台县-#FF0000", "盐亭县-#FF0066", "安县-#FF0000",
    "梓潼县-#33FF00", "北川羌族自治县-#FF0000", "平武县-#FF0066", "江油市-#FF0000"
];
var  guangyuanshis=[
    "市中区-#FF0000", "元坝区-#FF0066", "朝天区-#FF0000", "旺苍县-#FF0066", "青川县-#33FF00",
    "剑阁县-#FF0066", "汉中市-#FF0000", "榆林市-#33FF00", "安康市-#FF0000", "商洛市-#FF0066"
];
var suiningshis=[
    "船山区-#FF0000", "安居区-#FF0066", "蓬溪县-#FF0000", "射洪县-#FCFBBB", "大英县-#FF0066"
];
var neijiangshis=[
    "市中区-#FF0000", "东兴区-#FF0066", "威远县-#FF0066", "资中县-#FF0000"
];
var leshanshis=[
    "市中区-#FF0000", "沙湾区-#FF0066", "五通桥区-#FF0000", "金口河区-#FF0066", "犍为县-#33FF00","沐川县-#33FF00", "峨边彝族自治县-#33FF00", "夹江县-#FF0000", "马边彝族自治县-#FF0066", "峨眉山市-#FF0000"
];
var nanchongshis=[
    "顺庆区-#33FF00", "高坪区-#33FF00", "南部县-#FF0000", "营山县-#FF0066", "蓬安县-#FF0000",
    "仪陇县-#FF0000", "西充县-#33FF00", "阆中市-#FF0000"
];
var meishanshis=[
    "东坡区-#FF0000", "仁寿县-#FF0066", "彭山县-#FF0000", "洪雅县-#FF0000", "丹棱县-#FF0066",
    "青神县-#FF0000"
];
var yibinshis=[
    "翠屏区-#FF0066", "宜宾县-#FF0000", "南溪县-#FF0066", "江安县-#33FF00", "长宁县-#FF0000",
    "高县-#FF0000", "珙县-#FF0066", "筠连县-#FF0000", "兴文县-#33FF00", "屏山县-#FF0000"
];
var guanganshis=[
    "岳池县-#FF0066", "武胜县-#FF0000", "邻水县-#FF0066", "华蓥市-#33FF00"
];
var dazhoushis=[
    "通川区-#FF0000", "达县-#FF0066", "宣汉县-#FF0000", "开江县-#FF0066", "大竹县-#33FF00",
    "渠县-#FF0066", "万源市-#FF0000"
];
var yaanshis=[
    "雨城区-#FF0000", "名山县-#FF0066", "荥经县-#FF0000", "汉源县-#FF0000", "石棉县-#FF0066",
    "天全县-#FF0000","芦山县-#FF0000", "宝兴县-#FF0066"
];
var bazhongshis=[
    "巴州区-#FF0066", "通江县-#FF0000", "南江县-#FF0066", "平昌县-#33FF00"
];
var ziyangshis=[
    "雁江区-#FF0000", "安岳县-#FF0066", "乐至县-#FF0000", "简阳市-#FF0000"
];

var abazangzuqiangzuzizhizhous=[
    "汶川县-#FF0000", "理县-#FF0000", "茂县-#FF0000", "松潘县-#FF0066", "九寨沟县-#FF0066",
    "金川县-#FF0066","小金县-#FF0000", "黑水县-#FF0066", "马尔康县-#FF0000", "壤塘县-#FF0000",
    "阿坝县-#FF0000", "若尔盖县-#FF0066", "红原县-#FF0000"
];
var ganzizangzuzizhizhous=[
    "康定县-#FF0000", "泸定县-#FF0066", "丹巴县-#FF0000", "九龙县-#FF0066", "雅江县-#FF0000",
    "道孚县-#33FF00", "炉霍县-#FF0000", "甘孜县-#FF0066", "新龙县-#FF0000","德格县-#FF0000", "白玉县-#FF0000", "石渠县-#FF0000", "色达县-#FF0066", "理塘县-#FF0066",
    "巴塘县-#FF0066","乡城县-#FF0000","稻城县-#33FF00","得荣县-#FF0000"
];
var  liangshanyizuzizhizhous=[
    "西昌市-#FF0000", "木里藏族自治县-#FF0066", "盐源县-#FF0000", "德昌县-#FF0066", "会理县-#33FF00",
    "会东县-#FF0066", "宁南县-#FF0000", "普格县-#33FF00", "布拖县-#FF0000", "金阳县-#FF0066",
    "昭觉县-#FF0000", "喜德县-#FF0000", "冕宁县-#FF0000", "越西县-#FF0066", "甘洛县-#FF0066",
    "美姑县-#FF0066","雷波县-#FF0000"
];
var guiyangshis=[
    "南明区-#FF0000", "云岩区-#FF0066", "乌当区-#FF0000", "白云区-#FCFBBB", "小河区-#FF0066","开阳县-#FF0000", "息烽县-#FF0066", "修文县-#FF0000", "清镇市-#FF0066"
];
var liupanshuishis=[
    "钟山区-#FF0000", "六枝特区-#FF0066", "水城县-#FF0066", "盘县-#FF0000"
];
var zunyishis=[
    "红花岗区-#FF0000", "汇川区-#FF0066", "遵义县-#FF0000", "桐梓县-#FF0066", "绥阳县-#33FF00","正安县-#33FF00", "道真仡佬族苗族自治县-#33FF00", "务川仡佬族苗族自治县-#FF0000", "凤冈县-#FF0066", "湄潭县-#FF0000",
    "余庆县-#33FF00", "习水县-#33FF00", "赤水市-#FF0000", "仁怀市-#FF0066"
];
var anshunshis=[
    "西秀区-#33FF00", "平坝县-#33FF00", "普定县-#FF0000", "镇宁布依族苗族自治县-#FF0066", "关岭布依族苗族自治县-#FF0000",
    "紫云苗族布依族自治县-#FF0000"
];
var tongrediqus=[
    "铜仁市-#FF0000", "江口县-#FF0066", "玉屏侗族自治县-#FF0000", "石阡县-#FF0000", "思南县-#FF0066",
    "印江土家族苗族自治县-#FF0000","德江县-#FF0000", "沿河土家族自治县-#FF0066", "松桃苗族自治县-#FF0000", "万山特区-#FCFBBB"
];
var xingyishis=[
    "兴仁县-#33FF00", "普安县-#33FF00", "晴隆县-#FF0000", "贞丰县-#FF0066", "望谟县-#FF0000",
    "册亨县-#FF0000", "安龙县-#33FF00"
];
var bijieditus=[
    "毕节市-#FF0000", "大方县-#FF0066", "黔西县-#FF0000", "金沙县-#FF0000", "织金县-#FF0066",
    "纳雍县-#FF0000","赫章县-#33FF00"
];
var qiandongnanmiaozutongzuzizhizhous=[
    "凯里市-#FF0066", "黄平县-#FF0000", "施秉县-#FF0066", "三穗县-#33FF00", "镇远县-#FF0000",
    "岑巩县-#FF0000", "天柱县-#FF0066", "锦屏县-#FF0000", "剑河县-#33FF00", "台江县-#FF0000",
    "黎平县-#33FF00", "榕江县-#33FF00", "从江县-#FF0000", "雷山县-#FF0066", "麻江县-#FF0000",
    "丹寨县-#FF0000"
];
var qiannanbuyizumiaozuzizhizhous=[
    "都匀市-#FF0066", "福泉市-#FF0000", "荔波县-#FF0066", "贵定县-#33FF00", "瓮安县-#FF0000",
    "独山县-#FF0000", "平塘县-#FF0066", "罗甸县-#FF0000", "长顺县-#33FF00", "龙里县-#FF0000",
    "惠水县-#33FF00", "三都水族自治县-#33FF00"
];
var kunmingshis=[
    "五华区-#FF0066", "盘龙区-#FF0000", "官渡区-#FF0066", "西山区-#33FF00","东川区-#FF0000", "呈贡县-#FF0066",
    "晋宁县-#FF0000", "富民县-#FF0000", "宜良县-#FF0066","石林彝族自治县-#FF0000","嵩明县-#33FF00","禄劝彝族苗族自治县-#FF0000",
    "寻甸回族彝族自治县-#FF0066", "安宁市-#33FF00"
];
var qujingshis=[
    "麒麟区-#FF0000", "马龙县-#FF0066", "陆良县-#FF0000", "师宗县-#FF0066", "罗平县-#33FF00",
    "富源县-#FF0066", "会泽县-#FF0000","沾益县-#FF0000", "宣威市-#FF0000"
];
var yuxishis=[
    "江川县-#FF0000", "澄江县-#FF0066", "通海县-#FF0000", "华宁县-#FF0000", "易门县-#FF0066",
    "峨山彝族自治县-#FF0000","新平彝族傣族自治县-#FF0000"
];
var baoshanshis=[
    "隆阳区-#FF0066", "施甸县-#FF0000", "腾冲县-#FF0066", "龙陵县-#33FF00","昌宁县-#FF0000"
];
var shaotongshis=[
    "昭阳区-#FF0000", "鲁甸县-#FF0066", "巧家县-#FF0000", "盐津县-#FF0000","大关县-#FF0000", "理县-#FF0000", "茂县-#FF0000", "松潘县-#FF0066", "九寨沟县-#FF0066",
    "永善县-#FF0066","绥江县-#FF0000", "镇雄县-#FF0066","彝良县-#FF0000", "威信县-#FF0066", "通海县-#FF0000", "华宁县-#FF0000", "易门县-#FF0066",
    "水富县-#FF0000"
];

var lijiangshis=[
    "古城区-#FF0000", "玉龙纳西族自治县-#FF0000", "永胜县-#FF0000", "华坪县-#FF0066", "宁蒗彝族自治县-#FF0066"
];
var mojianghanizuzizhixians=[
    "景东彝族自治县-#FF0000", "景谷傣族彝族自治县-#FF0066", "江城哈尼族彝族自治县-#FF0000", "澜沧拉祜族自治县-#FF0000", "西盟佤族自治县-#FF0066"
] ;
var lincangshis=[
    "临翔区-#FF0000", "凤庆县-#FF0066", "云县-#FF0000", "永德县-#FF0066", "镇康县-#FF0000",
    "耿马傣族佤族自治县-#33FF00", "沧源佤族自治县-#FF0000"
];
var  chuxiongyizuzizhizhous=[
    "个旧市-#FF0000", "开远市-#FF0066", "蒙自县-#FF0000", "屏边苗族自治县-#FF0066", "建水县-#33FF00",
    "石屏县-#FF0066", "弥勒县-#FF0000", "泸西县-#33FF00", "元阳县-#FF0000","红河县-#FF0066", "绿春县-#FF0000","河口瑶族自治县-#FF0066"
];
var honghehanizuyizuzizhizhous=[
    "南明区-#FF0000", "云岩区-#FF0066", "乌当区-#FF0000", "白云区-#FCFBBB", "小河区-#FF0066","开阳县-#FF0000", "息烽县-#FF0066", "修文县-#FF0000", "清镇市-#FF0066"
];
var wenshanzhuangzumiaozuzizhizhous=[
    "文山县-#FF0000", "砚山县-#FF0066", "西畴县-#FF0066", "麻栗坡县-#FF0000","马关县-#FF0000", "丘北县-#FF0066", "广南县-#FF0000", "富宁县-#FF0066"
];
var xishuangbanladaizuzizhizhous=[
    "景洪市-#FF0000", "勐海县-#FF0066", "勐腊县-#FF0000"
];
var dalibaizuzizhizhous=[
    "大理市-#33FF00", "漾濞彝族自治县-#33FF00", "祥云县-#FF0000", "宾川县-#FF0066", "弥渡县-#FF0000",
    "南涧彝族自治县-#FF0000","巍山彝族回族自治县-#FF0000", "永平县-#FF0066", "云龙县-#FF0066","洱源县-#FF0066", "剑川县-#FF0000", "鹤庆县-#FF0000"
];
var dehongdaizujingbozuzizhizhous=[
    "瑞丽市-#FF0000", "潞西市-#FF0066", "梁河县-#FF0000", "盈江县-#FF0000", "陇川县-#FF0066"
];
var lujianglisuzuzizhizhous=[
    "泸水县-#33FF00", "福贡县-#33FF00", "贡山独龙族怒族自治县-#FF0000", "兰坪白族普米族自治县-#FF0066"
];

var diqingzangzuzizhizhous=[
    "香格里拉县-#FF0066", "德钦县-#FF0000", "维西傈僳族自治县-#FF0066"
];
var lasashis=[
    "城关区-#FF0000", "林周县-#FF0066", "当雄县-#FF0000", "尼木县-#FF0066", "曲水县-#33FF00",
    "堆龙德庆县-#FF0066", "达孜县-#FF0000","墨竹工卡县-#FF0066"
];
var changdudiqus=[
    "昌都县-#FF0000", "江达县-#FF0066", "贡觉县-#FF0000", "类乌齐县-#FF0000", "丁青县-#FF0066",
    "察雅县-#FF0000","八宿县-#FF0000", "左贡县-#FF0066","芒康县-#FF0000", "洛隆县-#FF0066", "边坝县-#FF0000"
];
var shannandiqus=[
    "乃东县-#FF0066", "扎囊县-#FF0000", "贡嘎县-#FF0066", "桑日县-#33FF00","琼结县-#FF0000", "曲松县-#FF0066", "措美县-#FF0000", "洛扎县-#FF0066", "加查县-#33FF00",
    "隆子县-#FF0066", "错那县-#FF0000","浪卡子县-#FF0000"
];
var rikazediqus=[
    "日喀则市-#FF0000", "南木林县-#FF0066", "江孜县-#FF0000", "定日县-#FF0000","萨迦县-#FF0000", "拉孜县-#FF0000",
    "谢通门县-#FF0000", "白朗县-#FF0066", "仁布县-#FF0066",
    "康马县-#FF0066","定结县-#FF0000","仲巴县-#FF0000", "亚东县-#FF0066", "吉隆县-#FF0000", "聂拉木县-#FF0000","岗巴县-#33FF00","萨嘎县-#FF0000"
];

var naqudiqus=[
    "那曲县-#FF0000", "嘉黎县-#FF0000", "比如县-#FF0000", "聂荣县-#FF0066", "安多县-#FF0066",
    "申扎县-#FF0066","索县-#FF0000", "班戈县-#FF0066", "巴青县-#FF0000", "尼玛县-#FF0000"
];
var alidiqus=[
    "普兰县-#FF0000", "札达县-#FF0066", "噶尔县-#FF0000", "日土县-#FF0066", "革吉县-#FF0000",
    "改则县-#33FF00", "措勤县-#FF0000"
];
var  linzhidiqus=[
    "林芝县-#FF0000", "工布江达县-#FF0066", "米林县-#FF0000", "墨脱县-#FF0066", "波密县-#33FF00",
    "察隅县-#FF0066", "朗县-#FF0000"
];
var xianshis=[
    "新城区-#FF0000", "碑林区-#FF0066", "莲湖区-#FF0000", "灞桥区-#FCFBBB", "未央区-#FF0066",
    "雁塔区-#FF0000", "阎良区-#FF0066", "临潼区-#FF0000", "长安区-#FF0066","蓝田县-#FF0000", "周至县-#FF0000", "比如县-#FF0000", "聂荣县-#FF0066", "安多县-#FF0066",
    "户县-#FF0066","索县-#FF0000", "高陵县-#FF0066"
];

var tongchuanshis=[
    "王益区-#FF0000", "印台区-#FF0066", "耀州区-#FF0000", "宜君县-#FF0066"
];
var baojishis=[
    "渭滨区-#33FF00", "金台区-#33FF00", "陈仓区-#FF0000", "凤翔县-#FF0066", "岐山县-#FF0000",
    "扶风县-#FF0000","眉县-#FF0000", "陇县-#FF0066", "千阳县-#FF0000", "麟游县-#FCFBBB", "凤县-#FF0066",
    "太白县-#FF0000"
];
var xianyangshis=[
    "秦都区-#FF0000", "杨凌区-#FF0066", "渭城区-#FF0000", "三原县-#FF0000", "泾阳县-#FF0066",
    "乾县-#FF0000","礼泉县-#FF0000", "永寿县-#FF0066", "彬县-#FF0000", "长武县-#FCFBBB","旬邑县-#33FF00", "淳化县-#33FF00", "武功县-#FF0000", "兴平市-#FF0066"
];
var weinanshis=[
    "临渭区-#33FF00", "华县-#33FF00", "潼关县-#FF0000", "大荔县-#FF0066", "合阳县-#FF0000",
    "澄城县-#FF0000", "蒲城县-#33FF00","白水县-#33FF00", "富平县-#33FF00", "韩城市-#FF0000", "华阴市-#FF0066"
];
var yananshis=[
    "宝塔区-#FF0000", "延长县-#FF0066", "延川县-#FF0000", "子长县-#FF0000", "安塞县-#FF0066",
    "志丹县-#FF0000","甘泉县-#33FF00", "富县-#33FF00", "洛川县-#33FF00", "宜川县-#FF0000", "黄龙县-#FF0066", "黄陵县-#FF0000"
];
var hanzhongshis=[
    "汉台区-#FF0066", "南郑县-#FF0000", "城固县-#FF0066", "洋县-#33FF00", "西乡县-#FF0000",
    "勉县-#FF0000", "略阳县-#FF0066", "镇巴县-#FF0000", "留坝县-#33FF00", "佛坪县-#FF0000"
];
var yulinshis=[
    "榆阳区-#FF0066", "神木县-#FF0000", "府谷县-#FF0066", "横山县-#33FF00", "靖边县-#FF0000",
    "定边县-#FF0000", "绥德县-#FF0066", "米脂县-#FF0000", "佳县-#33FF00", "吴堡县-#FF0000",
    "清涧县-#33FF00", "子洲县-#33FF00"
];
var ankangshis=[
    "汉滨区-#FF0066", "汉阴县-#FF0000", "石泉县-#FF0066", "宁陕县-#33FF00","紫阳县-#FF0000", "岚皋县-#FF0066",
    "平利县-#FF0000", "镇坪县-#FF0000", "旬阳县-#FF0066","白河县-#FF0000"
];
var shangluoshis=[
    "商州区-#FF0000", "洛南县-#FF0066", "丹凤县-#FF0000", "商南县-#FF0066", "山阳县-#33FF00",
    "镇安县-#FF0066", "柞水县-#FF0000"
];
var nanzhoushis=[
    "城关区-#FF0000", "西固区-#FF0066", "红古区-#FF0000", "永登县-#FF0000", "皋兰县-#FF0066",
    "榆中县-#FF0000"
];
var jiayuguanshis=[
    "嘉峪关市-#FF0066"
];
var jinchangshis=[
    "金川区-#FF0000", "永昌县-#FF0066"
];

var baiyinshis=[
    "白银区-#FF0000", "平川区-#FF0000", "靖远县-#FF0000", "会宁县-#FF0066", "景泰县-#FF0066"
];
var tianshuishis=[
    "清水县-#FF0000", "秦安县-#FF0066", "甘谷县-#FF0000", "武山县-#FF0000", "张家川回族自治县-#FF0066"
];
var wuweishis=[
    "凉州区-#FF0000", "民勤县-#FF0066", "古浪县-#FF0000", "天祝藏族自治县-#FF0066"
];
var  zhangyeshis=[
    "甘州区-#FF0000", "肃南裕固族自治县-#FF0066", "民乐县-#FF0000", "临泽县-#FF0066", "高台县-#33FF00",
    "山丹县-#FF0066"
];
var pingliangshis=[
    "崆峒区-#FF0000", "泾川县-#FF0066", "灵台县-#FF0000", "崇信县-#FCFBBB", "华亭县-#FF0066","庄浪县-#FF0000", "静宁县-#FF0066"
];
var jiuquanshis=[
    "肃州区-#FF0000", "金塔县-#FF0066", "肃北蒙古族自治县-#FF0066", "阿克塞哈萨克族自治县-#FF0000","玉门市-#FF0000", "敦煌市-#FF0066","瓜州县-#33FF00"
];
var qinyangshis=[
    "西峰区-#FF0000", "庆城县-#FF0066", "环县-#FF0000","华池县-#FF0000", "合水县-#FF0000", "正宁县-#FF0000", "宁县-#FF0066", "镇原县-#FF0066"
];
var dingxishis=[
    "安定区-#33FF00", "通渭县-#33FF00", "陇西县-#FF0000", "渭源县-#FF0066", "临洮县-#FF0000",
    "漳县-#FF0000","岷县-#FF0000"
];
var longnanshis=[
    "武都区-#FF0000", "成县-#FF0066", "文县-#FF0000", "宕昌县-#FF0000", "康县-#FF0066","西和县-#FF0000", "礼县-#FF0066", "徽县-#FF0066", "两当县-#FF0000"
];
var linxiahuizuzizhizhous=[
    "临夏县-#33FF00", "康乐县-#33FF00", "永靖县-#FF0000", "广河县-#FF0066", "和政县-#33FF00", "东乡族自治县-#33FF00"
];

var gannanzangzuzizhizhous=[
    "合作市-#FF0066", "临潭县-#FF0000", "卓尼县-#FF0066","舟曲县#FF0000", "迭部县-#FF0066", "玛曲县-#FF0000", "碌曲县-#FCFBBB", "夏河县-#FF0066"
];
var xiningshis=[
    "城东区-#FF0000", "城中区-#FF0066", "城西区-#FF0000", "城北区-#FF0066", "大通回族土族自治县-#33FF00",
    "湟中县-#FF0066", "湟源县-#FF0000"
];

var haidongdiqus=[
    "平安县-#FF0000", "民和回族土族自治县-#FF0066", "乐都县-#FF0000", "互助土族自治县-#FF0066", "化隆回族自治县-#33FF00",
    "循化撒拉族自治县-#FF0066"
];
var haibeizangzuzizhizhous=[
    "门源回族自治县-#FF0000", "祁连县-#FF0066", "海晏县-#FF0000", "刚察县-#FF0000"
];
var huangnanzangzuzizhizhous=[
    "同仁县-#FF0066", "尖扎县-#FF0000", "泽库县-#FF0066", "河南蒙古族自治县-#33FF00"
];
var hainanzangzuzizhizhous=[
    "共和县-#FF0000", "同德县-#FF0066", "贵德县-#FF0000", "兴海县-#FF0000","贵南县-#FF0000"
];

var guoluozangzuzizhizhous=[
    "玛沁县-#FF0000", "班玛县-#FF0000", "甘德县-#FF0000", "达日县-#FF0066", "久治县-#FF0066","玛多县-#FF0000"
];
var yushuzangzuzizhizhous=[
    "玉树县-#FF0000", "杂多县-#FF0066", "称多县-#FF0000", "治多县-#FF0000", "囊谦县-#FF0066","曲麻莱县-#FF0000"
];
var haiximengguzuzangzuzizhizhous=[
    "格尔木市-#FF0000", "德令哈市-#FF0066", "乌兰县-#FF0000", "都兰县-#FF0066", "天峻县-#FF0000"
];
var  yinchuanshis=[
    "兴庆区-#FF0000", "西夏区-#FF0066", "金凤区-#FF0000", "永宁县-#FF0066", "贺兰县-#33FF00",
    "贺兰县-#FF0066"
];
var shizuishanshis=[
    "大武口区-#FF0000", "惠农区-#FF0066", "平罗县-#FF0000"
];
var wuzhongshis=[
    "利通区-#FF0000", "盐池县-#FF0066", "同心县-#FF0066", "青铜峡市-#FF0000"
];
var guyuanshis=[
    "原州区-#FF0000", "西吉县-#FF0066", "隆德县-#FF0	000","泾源县-#FF0000", "彭阳县-#FF0066"
];
var zhongweishis=[
    "沙坡头区-#33FF00", "中宁县-#33FF00", "海原县-#FF0000"
];
var wulumuqishis=[
    "天山区-#FF0000", "沙依巴克区-#FF0066", "新市区-#FF0000", "水磨沟区-#FF0000", "头屯河区-#FF0066",
    "达坂城区-#FF0066","东山区-#FF0000", "乌鲁木齐县-#FF0066"
];
var kelamayishis=[
    "独山子区-#33FF00", "克拉玛依区-#33FF00", "白碱滩区-#FF0000", "乌尔禾区-#FF0066"
];
//	
var tulufandiqus=[
    "吐鲁番市-#FF0000", "鄯善县-#FF0000", "托克逊县-#FF0000"
];
var hamidiqus=[
    "哈密市-#FF0000", "伊吾县-#FF0066"
];
var  changjihuizuzizhizhous=[
    "昌吉市-#FF0000", "阜康市-#FF0066", "米泉市-#FF0000", "呼图壁县-#FF0066", "玛纳斯县-#33FF00",
    "奇台县-#FF0066", "吉木萨尔县-#FF0000","木垒哈萨克自治县-#33FF00"
];
var boertalamengguzizhizhous=[
    "博乐市-#FF0000", "精河县-#FF0066", "温泉县-#FF0000"
];

var bayinguolengmengguzizhizhous=[
    "库尔勒市-#FF0000", "轮台县-#FF0066", "尉犁县-#FF0000", "若羌县-#FF0066","且末县-#FF0000", "焉耆回族自治县-#FF0066", "和静县-#FF0000", "和硕县-#FF0066",
    "博湖县-#FF0000"];
var akesudiqus=[
    "温宿县-#33FF00", "库车县-#33FF00", "沙雅县-#FF0000", "新和县-#FF0066", "拜城县-#FF0000",
    "乌什县-#FF0000","阿瓦提县-#FF0000", "柯坪县-#FF0066"
];
var atushishis=[
    "阿克陶县-#FF0000", "阿合奇县-#FF0066", "乌恰县-#FF0000"
];
var kashidiqus=[
    "喀什市-#33FF00", "疏附县-#33FF00", "疏勒县-#FF0000", "英吉沙县-#FF0066", "泽普县-#FF0000",
    "莎车县-#FF0000", "叶城县-#33FF00","麦盖提县-#33FF00", "岳普湖县-#33FF00", "伽师县-#FF0000", "巴楚县-#FF0066"
];
var hetiandiqus=[
    "和田市-#FF0000", "和田县-#FF0066", "墨玉县-#FF0000", "皮山县-#FF0000", "洛浦县-#FF0066",
    "策勒县-#FF0000","于田县-#33FF00", "民丰县-#33FF00"
];
var yilihasakezizhizhous=[
    "伊宁市-#FF0066", "奎屯市-#FF0000", "伊宁县-#FF0066", "察布查尔锡伯自治县-#33FF00", "霍城县-#FF0000",
    "巩留县-#FF0000", "新源县-#FF0066", "昭苏县-#FF0000", "特克斯县-#33FF00", "尼勒克县-#FF0000"
];
var tachengdiqus=[
    "塔城市-#FF0066", "乌苏市-#FF0000", "额敏县-#FF0066", "沙湾县-#33FF00", "托里县-#FF0000",
    "裕民县-#FF0000", "和布克赛尔蒙古自治县-#FF0066"
];
var aletaidiqus=[
    "阿勒泰市-#FF0066", "布尔津县-#FF0000", "富蕴县-#FF0066", "福海县-#33FF00","哈巴河县-#FF0000", "青河县-#FF0066",
    "吉木乃县-#FF0000"
];
var shihezishis=[
    "阿拉尔市-#FF0000", "图木舒克市-#FF0066", "五家渠市-#FF0000"
];
if(pname=="北京市"){
    drawColor("北京市",beijingshis);
}else if(pname=="天津市"){
    drawColor("天津市",tianjingshis);
}else if(pname=="石家庄市"){
    drawColor("石家庄市",shijiazhuangshis);
}else if(pname=="唐山市"){
    drawColor("唐山市",tangshanshis);
}else if(pname=="秦皇岛市"){
    drawColor("秦皇岛市",qinghuangdaoshis);
}else if(pname=="邯郸市"){
    drawColor("邯郸市",handanshis);
}else if(pname=="邢台市"){
    drawColor("邢台市",xingtaishis);
}else if(pname=="保定市"){
    drawColor("保定市",baodingshis);
}else if(pname=="张家口市"){
    drawColor("张家口市",zhangjiakoushis);
}else if(pname=="承德市"){
    drawColor("承德市",chengdeshis);
}else if(pname=="沧州市"){
    drawColor("沧州市",cangzhouzhis);
}else if(pname=="廊坊市"){
    drawColor("廊坊市",langfangshis);
}else if(pname=="衡水市"){
    drawColor("衡水市",hengshuishis);
}else if(pname=="太原市"){
    drawColor("太原市",taiyuanshis);
}else if(pname=="大同市"){
    drawColor("大同市",datongshis);
}else if(pname=="阳泉市"){
    drawColor("阳泉市",yangquanshis);
}else if(pname=="长治市"){
    drawColor("长治市",changzhishis);
}else if(pname=="晋城市"){
    drawColor("晋城市",jinchengshis);
}else if(pname=="朔州市"){
    drawColor("朔州市",suzhoushis);
}else if(pname=="晋中市"){
    drawColor("晋中市",jinzhongshis);
}else if(pname=="运城市"){
    drawColor("运城市",yunchengshis);
}else if(pname=="忻州市"){
    drawColor("忻州市",xinzhoushis);
}else if(pname=="临汾市"){
    drawColor("临汾市",linfenshis);
}else if(pname=="吕梁市"){
    drawColor("吕梁市",lvliangshis);
}else if(pname=="呼和浩特市"){
    drawColor("呼和浩特市",huhehaoteshis);
}else if(pname=="包头市"){
    drawColor("包头市",baotoushis);
}else if(pname=="乌海市"){
    drawColor("乌海市",wuhaishis);
}else if(pname=="赤峰市"){
    drawColor("赤峰市",chifengshis);
}else if(pname=="通辽市"){
    drawColor("通辽市",tongliaoshis);
}else if(pname=="鄂尔多斯市"){
    drawColor("鄂尔多斯市",eerduoshis);
}else if(pname=="呼伦贝尔市"){
    drawColor("呼伦贝尔市",hulubeiershis);
}else if(pname=="巴彦淖尔市"){
    drawColor("巴彦淖尔市",bayanzhuoershis);
}else if(pname=="乌兰察布市"){
    drawColor("乌兰察布市",wulanchabushis);
}else if(pname=="兴安盟"){
    drawColor("兴安盟",xinanmens);
}else if(pname=="锡林郭勒盟"){
    drawColor("锡林郭勒盟",xilinguolemens);
}else if(pname=="阿拉善盟"){
    drawColor("阿拉善盟",alashanmens);
}else if(pname=="沈阳市"){
    drawColor("沈阳市",shenyangshis);
}else if(pname=="大连市"){
    drawColor("大连市",dalianshis);
}else if(pname=="鞍山市"){
    drawColor("鞍山市",anshanshis);
}else if(pname=="抚顺市"){
    drawColor("抚顺市",fushunshis);
}else if(pname=="本溪市"){
    drawColor("本溪市",benxishis);
}else if(pname=="丹东市"){
    drawColor("丹东市",dandongshis);
}else if(pname=="锦州市"){
    drawColor("锦州市",jinzhoushis);
}else if(pname=="营口市"){
    drawColor("营口市",yinkoushis);
}else if(pname=="阜新市"){
    drawColor("阜新市",buxinshis);
}else if(pname=="辽阳市"){
    drawColor("辽阳市",liaoyangshis);
}else if(pname=="盘锦市"){
    drawColor("盘锦市",panjinshis);
}else if(pname=="铁岭市"){
    drawColor("铁岭市",tielingshis);
}else if(pname=="朝阳市"){
    drawColor("朝阳市",chaoyangshis);
}else if(pname=="葫芦岛市"){
    drawColor("葫芦岛市",huludaoshis);
}else if(pname=="长春市"){
    drawColor("长春市",changchunshis);
}else if(pname=="吉林市"){
    drawColor("吉林市",jilinshis);
}else if(pname=="四平市"){
    drawColor("四平市",sipingshis);
}else if(pname=="辽源市"){
    drawColor("辽源市",liaoyuanshis);
}else if(pname=="通化市"){
    drawColor("通化市",tonghuashis);
}else if(pname=="白山市"){
    drawColor("白山市",baishanshis);
}else if(pname=="松原市"){
    drawColor("松原市",songyuanshis);
}else if(pname=="白城市"){
    drawColor("白城市",baichengshis);
}else if(pname=="延边朝鲜族自治州"){
    drawColor("延边朝鲜族自治州",yanbianchaoxianzuzizhizhous);
}else if(pname=="哈尔滨市"){
    drawColor("哈尔滨市",haerbinshis);
}else if(pname=="齐齐哈尔市"){
    drawColor("齐齐哈尔市",qiqihaershis);
}else if(pname=="鸡西市"){
    drawColor("鸡西市",jixishis);
}else if(pname=="鹤岗市"){
    drawColor("鹤岗市",hegangshis);
}else if(pname=="双鸭山市"){
    drawColor("双鸭山市",shuangyashanshis);
}else if(pname=="大庆市"){
    drawColor("大庆市",daqinshis);
}else if(pname=="伊春市"){
    drawColor("伊春市",yichunshis);
}else if(pname=="佳木斯市"){
    drawColor("佳木斯市",jiamusishis);
}else if(pname=="七台河市"){
    drawColor("七台河市",qitaiheshis);
}else if(pname=="牡丹江市"){
    drawColor("牡丹江市",mudanjiangshis);
}else if(pname=="黑河市"){
    drawColor("黑河市",heiheshis);
}else if(pname=="绥化市"){
    drawColor("绥化市",suihuashis);
}else if(pname=="大兴安岭地区"){
    drawColor("大兴安岭地区",daxinganlings);
}else if(pname=="上海市"){
    drawColor("上海市",shanghaishis);
}else if(pname=="南京市"){
    drawColor("南京市",nanjingshis);
}else if(pname=="无锡市"){
    drawColor("无锡市",wuxishis);
}else if(pname=="徐州市"){
    drawColor("徐州市",xuzhoushis);
}else if(pname=="常州市"){
    drawColor("常州市",changzhoushis);
}else if(pname=="苏州市"){
    drawColor("苏州市",suzhoushis);
}else if(pname=="南通市"){
    drawColor("南通市",nantongshis);
}else if(pname=="连云港市"){
    drawColor("连云港市",lianyungangshis);
}else if(pname=="淮安市"){
    drawColor("淮安市",huaianshis);
}else if(pname=="盐城市"){
    drawColor("盐城市",yanchengshis);
}else if(pname=="扬州市"){
    drawColor("扬州市",yangzhoushis);
}else if(pname=="镇江市"){
    drawColor("镇江市",zhenjiangshis);
}else if(pname=="泰州市"){
    drawColor("泰州市",taizhoushis);
}else if(pname=="宿迁市"){
    drawColor("宿迁市",suqianshis);
}else if(pname=="杭州市"){
    drawColor("杭州市",hangzhoushis);
}else if(pname=="宁波市"){
    drawColor("宁波市",ningboshis);
}else if(pname=="温州市"){
    drawColor("温州市",wenzhoushis);
}else if(pname=="嘉兴市"){
    drawColor("嘉兴市",jiaxingshis);
}else if(pname=="湖州市"){
    drawColor("湖州市",huzhoushis);
}else if(pname=="绍兴市"){
    drawColor("绍兴市",shaoxinshis);
}else if(pname=="金华市"){
    drawColor("金华市",jinhuashis);
}else if(pname=="衢州市"){
    drawColor("衢州市",quzhoushis);
}else if(pname=="舟山市"){
    drawColor("舟山市",zhoushanshis);
}else if(pname=="台州市"){
    drawColor("台州市",tazhoushis);
}else if(pname=="丽水市"){
    drawColor("丽水市",lishuishis);
}else if(pname=="合肥市"){
    drawColor("合肥市",hefeishis);
}else if(pname=="芜湖市"){
    drawColor("芜湖市",wuhushis);
}else if(pname=="蚌埠市"){
    drawColor("蚌埠市",bangbushis);
}else if(pname=="淮南市"){
    drawColor("淮南市",huainanshis);
}else if(pname=="马鞍山市"){
    drawColor("马鞍山市",maanhanshis);
}else if(pname=="淮北市"){
    drawColor("淮北市",huanbeishis);
}else if(pname=="铜陵市"){
    drawColor("铜陵市",tonglingshis);
}else if(pname=="安庆市"){
    drawColor("安庆市",anqinshis);
}else if(pname=="黄山市"){
    drawColor("黄山市",huangshanshis);
}else if(pname=="滁州市"){
    drawColor("滁州市",xuzhoushis);
}else if(pname=="阜阳市"){
    drawColor("阜阳市",buyangshis);
}else if(pname=="宿州市"){
    drawColor("宿州市",suzhoushis);
}else if(pname=="巢湖市"){
    drawColor("巢湖市",chaohushis);
}else if(pname=="六安市"){
    drawColor("六安市",liuanshis);
}else if(pname=="亳州市"){
    drawColor("亳州市",haozhoushis);
}else if(pname=="池州市"){
    drawColor("池州市",chizhoushis);
}else if(pname=="宣城市"){
    drawColor("宣城市",xuanchengshis);
}else if(pname=="福州市"){
    drawColor("福州市",fuzhoushis);
}else if(pname=="厦门市"){
    drawColor("厦门市",xiamenshis);
}else if(pname=="莆田市"){
    drawColor("莆田市",putianshis);
}else if(pname=="三明市"){
    drawColor("三明市",sanmingshis);
}else if(pname=="泉州市"){
    drawColor("泉州市",quanzhoushis);
}else if(pname=="漳州市"){
    drawColor("漳州市",zhangzhouoshis);
}else if(pname=="南平市"){
    drawColor("南平市",nanpingshis);
}else if(pname=="龙岩市"){
    drawColor("龙岩市",longyanshis);
}else if(pname=="宁德市"){
    drawColor("宁德市",ningdeshis);
}else if(pname=="南昌市"){
    drawColor("南昌市",nanchangshis);
}else if(pname=="景德镇市"){
    drawColor("景德镇市",jingdezhenshis);
}else if(pname=="萍乡市"){
    drawColor("萍乡市",pingxiangshis);
}else if(pname=="九江市"){
    drawColor("九江市",jiujiangshis);
}else if(pname=="新余市"){
    drawColor("新余市",xinyushis);
}else if(pname=="鹰潭市"){
    drawColor("鹰潭市",yintanshis);
}else if(pname=="赣州市"){
    drawColor("赣州市",ganzhoushis);
}else if(pname=="吉安市"){
    drawColor("吉安市",jianshis);
}else if(pname=="宜春市"){
    drawColor("宜春市",yichongshis);
}else if(pname=="抚州市"){
    drawColor("抚州市",wuzhoushis);
}else if(pname=="上饶市"){
    drawColor("上饶市",shangraoshis);
}else if(pname=="济南市"){
    drawColor("济南市",jinanshis);
}else if(pname=="青岛市"){
    drawColor("青岛市",qingdaoshis);
}else if(pname=="淄博市"){
    drawColor("淄博市",ziboshis);
}else if(pname=="枣庄市"){
    drawColor("枣庄市",zaozhuangshis);
}else if(pname=="东营市"){
    drawColor("东营市",dongyinshis);
}else if(pname=="烟台市"){
    drawColor("烟台市",yantaishis);
}else if(pname=="潍坊市"){
    drawColor("潍坊市",weifangshis);
}else if(pname=="济宁市"){
    drawColor("济宁市",jiningshis);
}else if(pname=="泰安市"){
    drawColor("泰安市",qinanshis);
}else if(pname=="威海市"){
    drawColor("威海市",weihaishis);
}else if(pname=="日照市"){
    drawColor("日照市",rizhaoshis);
}else if(pname=="莱芜市"){
    drawColor("莱芜市",laiwushis);
}else if(pname=="临沂市"){
    drawColor("临沂市",linxishis);
}else if(pname=="德州市"){
    drawColor("德州市",dezhoushis);
}else if(pname=="聊城市"){
    drawColor("聊城市",laiochengshis);
}else if(pname=="滨州市"){
    drawColor("滨州市",binzhoushis);
}else if(pname=="牡丹区"){
    drawColor("牡丹区",mudanqus);
}else if(pname=="郑州市"){
    drawColor("郑州市",zhenzhoushis);
}else if(pname=="开封市"){
    drawColor("开封市",kaifenshis);
}else if(pname=="洛阳市"){
    drawColor("洛阳市",luoyangshis);
}else if(pname=="平顶山市"){
    drawColor("平顶山市",pingdingshanshis);
}else if(pname=="安阳市"){
    drawColor("安阳市",anyangshis);
}else if(pname=="鹤壁市"){
    drawColor("鹤壁市",hebishis);
}else if(pname=="新乡市"){
    drawColor("新乡市",xinxiangshis);
}else if(pname=="焦作市"){
    drawColor("焦作市",jiaozuoshis);
}else if(pname=="濮阳市"){
    drawColor("濮阳市",puyangshis);
}else if(pname=="许昌市"){
    drawColor("许昌市",xuchangshis);
}else if(pname=="漯河市"){
    drawColor("漯河市",luoheshis);
}else if(pname=="三门峡市"){
    drawColor("三门峡市",sanmenxiashis);
}else if(pname=="南阳市"){
    drawColor("南阳市",nanyangshis);
}else if(pname=="商丘市"){
    drawColor("商丘市",shangqiushis);
}else if(pname=="信阳市"){
    drawColor("信阳市",xinyangshis);
}else if(pname=="周口市"){
    drawColor("周口市",zhoukoushis);
}else if(pname=="驻马店市"){
    drawColor("驻马店市",zhumadianshis);
}else if(pname=="武汉市"){
    drawColor("武汉市",wuhanshis);
}else if(pname=="黄石市"){
    drawColor("黄石市",huangshishis);
}else if(pname=="十堰市"){
    drawColor("十堰市",shiyanshis);
}else if(pname=="宜昌市"){
    drawColor("宜昌市",yichangshis);
}else if(pname=="襄樊市"){
    drawColor("襄樊市",xiangfanshis);
}else if(pname=="鄂州市"){
    drawColor("鄂州市",ezhoushis);
}else if(pname=="荆门市"){
    drawColor("荆门市",jinmenshis);
}else if(pname=="孝感市"){
    drawColor("孝感市",xiaoganshis);
}else if(pname=="荆州市"){
    drawColor("荆州市",jinzhoushis);
}else if(pname=="黄冈市"){
    drawColor("黄冈市",huanggangshis);
}else if(pname=="咸宁市"){
    drawColor("咸宁市",xianningshis);
}else if(pname=="随州市"){
    drawColor("随州市",suizhoushis);
}else if(pname=="恩施土家族苗族自治州"){
    drawColor("恩施土家族苗族自治州",enshitujiazumiaozuzizhizhous);
}else if(pname=="仙桃市"){
    drawColor("仙桃市",xiantaoshis);
}else if(pname=="长沙市"){
    drawColor("长沙市",changshashis);
}else if(pname=="株洲市"){
    drawColor("株洲市",zhuzhoushis);
}else if(pname=="湘潭市"){
    drawColor("湘潭市",xiangtanshis);
}else if(pname=="衡阳市"){
    drawColor("衡阳市",hengyangshis);
}else if(pname=="邵阳市"){
    drawColor("邵阳市",shaoyangshis);
}else if(pname=="岳阳市"){
    drawColor("岳阳市",yueyangshis);
}else if(pname=="常德市"){
    drawColor("常德市",changdeshis);
}else if(pname=="张家界市"){
    drawColor("张家界市",zhangjiajieshis);
}else if(pname=="益阳市"){
    drawColor("益阳市",yiyangshis);
}else if(pname=="郴州市"){
    drawColor("郴州市",binzhoushis);
}else if(pname=="永州市"){
    drawColor("永州市",yongzhoushis);
}else if(pname=="怀化市"){
    drawColor("怀化市",huaihuashis);
}else if(pname=="娄底市"){
    drawColor("娄底市",loudishis);
}else if(pname=="湘西土家族苗族自治州"){
    drawColor("湘西土家族苗族自治州",xiangxitujiazumiaozuzizhizhous);
}else if(pname=="广州市"){
    drawColor("广州市",guangzhoushis);
}else if(pname=="韶关市"){
    drawColor("韶关市",shaoguanshis);
}else if(pname=="深圳市"){
    drawColor("深圳市",shenzhenshis);
}else if(pname=="珠海市"){
    drawColor("珠海市",zhuhaoshis);
}else if(pname=="汕头市"){
    drawColor("汕头市",shantoushis);
}else if(pname=="佛山市"){
    drawColor("佛山市",foshanshis);
}else if(pname=="江门市"){
    drawColor("江门市",jiangmenshis);
}else if(pname=="湛江市"){
    drawColor("湛江市",zhanjiangshis);
}else if(pname=="茂名市"){
    drawColor("茂名市",maomingshis);
}else if(pname=="肇庆市"){
    drawColor("肇庆市",zhaoqinshis);
}else if(pname=="惠州市"){
    drawColor("惠州市",huizhoushis);
}else if(pname=="梅州市"){
    drawColor("梅州市",meizhoushis);
}else if(pname=="汕尾市"){
    drawColor("汕尾市",shanweishis);
}else if(pname=="河源市"){
    drawColor("河源市",heyuanshis);
}else if(pname=="阳江市"){
    drawColor("阳江市",yangjiangshis);
}else if(pname=="清远市"){
    drawColor("清远市",qingyuanshis);
}else if(pname=="东莞市"){
    drawColor("东莞市",dongwanshis);
}else if(pname=="中山市"){
    drawColor("中山市",zhongshanshis);
}else if(pname=="潮州市"){
    drawColor("潮州市",chaozhoushis);
}else if(pname=="揭阳市"){
    drawColor("揭阳市",jieyangshis);
}else if(pname=="云浮市"){
    drawColor("云浮市",yunfushis);
}else if(pname=="南宁市"){
    drawColor("南宁市",nanningshis);
}else if(pname=="柳州市"){
    drawColor("柳州市",guilinshis);
}else if(pname=="桂林市"){
    drawColor("桂林市",guizhoushis);
}else if(pname=="梧州市"){
    drawColor("梧州市",wuzhoushis);
}else if(pname=="北海市"){
    drawColor("北海市",beihaishis);
}else if(pname=="防城港市"){
    drawColor("防城港市",fangchenggangshis);
}else if(pname=="钦州市"){
    drawColor("钦州市",qinzhoushis);
}else if(pname=="贵港市"){
    drawColor("贵港市",guigangshis);
}else if(pname=="玉林市"){
    drawColor("玉林市",yulinshis);
}else if(pname=="百色市"){
    drawColor("百色市",baiseshis);
}else if(pname=="贺州市"){
    drawColor("贺州市",hezhoushis);
}else if(pname=="河池市"){
    drawColor("河池市",hechishis);
}else if(pname=="来宾市"){
    drawColor("来宾市",laibinshis);
}else if(pname=="崇左市"){
    drawColor("崇左市",chongzuoshis);
}else if(pname=="海口市"){
    drawColor("海口市",haikoushis);
}else if(pname=="三亚市"){
    drawColor("三亚市",sanyashis);
}else if(pname=="五指山市"){
    drawColor("五指山市",wuzhishanshis);
}else if(pname=="重庆市"){
    drawColor("重庆市",chongqinshis);
}else if(pname=="成都市"){
    drawColor("成都市",chengdushis);
}else if(pname=="自贡市"){
    drawColor("自贡市",zigongshis);
}else if(pname=="攀枝花市"){
    drawColor("攀枝花市",panzhihuashis);
}else if(pname=="泸州市"){
    drawColor("泸州市",luzhoushis);
}else if(pname=="德阳市"){
    drawColor("德阳市",deyangshis);
}else if(pname=="绵阳市"){
    drawColor("绵阳市",mianyangshis);
}else if(pname=="广元市"){
    drawColor("广元市",guangyuanshis);
}else if(pname=="遂宁市"){
    drawColor("遂宁市",suiningshis);
}else if(pname=="内江市"){
    drawColor("内江市",neijiangshis);
}else if(pname=="乐山市"){
    drawColor("乐山市",leshanshis);
}else if(pname=="南充市"){
    drawColor("南充市",nanchongshis);
}else if(pname=="眉山市"){
    drawColor("眉山市",meishanshis);
}else if(pname=="宜宾市"){
    drawColor("宜宾市",yibishis);
}else if(pname=="广安市"){
    drawColor("广安市",guanganshis);
}else if(pname=="达州市"){
    drawColor("达州市",dazhoushis);
}else if(pname=="雅安市"){
    drawColor("雅安市",yaanshis);
}else if(pname=="巴中市"){
    drawColor("巴中市",bazhongshis);
}else if(pname=="资阳市"){
    drawColor("资阳市",ziyangshis);
}else if(pname=="阿坝藏族羌族自治州"){
    drawColor("阿坝藏族羌族自治州",abazangzuqiangzuzizhizhous);
}else if(pname=="甘孜藏族自治州"){
    drawColor("甘孜藏族自治州",ganzizangzuzizhizhous);
}else if(pname=="凉山彝族自治州"){
    drawColor("凉山彝族自治州",liangshanyizuzizhizhous);
}else if(pname=="贵阳市"){
    drawColor("贵阳市",guiyangshis);
}else if(pname=="六盘水市"){
    drawColor("六盘水市",liupanshuishis);
}else if(pname=="遵义市"){
    drawColor("遵义市",zunyishis);
}else if(pname=="安顺市"){
    drawColor("安顺市",anshunshis);
}else if(pname=="铜仁地区"){
    drawColor("铜仁地区",tongrediqus);
}else if(pname=="兴义市"){
    drawColor("兴义市",xingyishis);
}else if(pname=="毕节地区"){
    drawColor("毕节地区",bijieditus);
}else if(pname=="黔东南苗族侗族自治州"){
    drawColor("黔东南苗族侗族自治州",qiandongnanmiaozutongzuzizhizhous);
}else if(pname=="黔南布依族苗族自治州"){
    drawColor("黔南布依族苗族自治州",qiannanbuyizumiaozuzizhizhous);
}else if(pname=="昆明市"){
    drawColor("昆明市",kunmingshis);
}else if(pname=="曲靖市"){
    drawColor("曲靖市",qujingshis);
}else if(pname=="玉溪市"){
    drawColor("玉溪市",yuxishis);
}else if(pname=="保山市"){
    drawColor("保山市",baoshanshis);
}else if(pname=="昭通市"){
    drawColor("昭通市",shaotongshis);
}else if(pname=="丽江市"){
    drawColor("丽江市",lijiangshis);
}else if(pname=="墨江哈尼族自治县"){
    drawColor("墨江哈尼族自治县",mojianghanizuzizhixians);
}else if(pname=="临沧市"){
    drawColor("临沧市",lincangshis);
}else if(pname=="楚雄彝族自治州"){
    drawColor("楚雄彝族自治州",chuxiongyizuzizhizhous);
}else if(pname=="红河哈尼族彝族自治州"){
    drawColor("红河哈尼族彝族自治州",honghehanizuyizuzizhizhous);
}else if(pname=="文山壮族苗族自治州"){
    drawColor("文山壮族苗族自治州",wenshanzhuangzumiaozuzizhizhous);
}else if(pname=="西双版纳傣族自治州"){
    drawColor("西双版纳傣族自治州",xishuangbannadaizuzizhizhous);
}else if(pname=="大理白族自治州"){
    drawColor("大理白族自治州",dalibaizuzizhizhous);
}else if(pname=="德宏傣族景颇族自治州"){
    drawColor("德宏傣族景颇族自治州",dehongdaizujingbozuzizhizhous);
}else if(pname=="怒江傈僳族自治州"){
    drawColor("怒江傈僳族自治州",lujianglisuzizhizhous);
}else if(pname=="迪庆藏族自治州"){
    drawColor("迪庆藏族自治州",diqinzangzuzizhizhous);
}else if(pname=="拉萨市"){
    drawColor("拉萨市",lasashis);
}else if(pname=="昌都地区"){
    drawColor("昌都地区",changdudiqus);
}else if(pname=="山南地区"){
    drawColor("山南地区",shannandiqus);
}else if(pname=="日喀则地区"){
    drawColor("日喀则地区",rikazediqus);
}else if(pname=="那曲地区"){
    drawColor("那曲地区",naqudiqus);
}else if(pname=="阿里地区"){
    drawColor("阿里地区",alidiqus);
}else if(pname=="林芝地区"){
    drawColor("林芝地区",linzhidiqus);
}else if(pname=="西安市"){
    drawColor("西安市",xianshis);
}else if(pname=="铜川市"){
    drawColor("铜川市",tongchuanshis);
}else if(pname=="宝鸡市"){
    drawColor("宝鸡市",baojishis);
}else if(pname=="咸阳市"){
    drawColor("咸阳市",xianyangshis);
}else if(pname=="渭南市"){
    drawColor("渭南市",weinanshis);
}else if(pname=="延安市"){
    drawColor("延安市",yananshis);
}else if(pname=="汉中市"){
    drawColor("汉中市",hanzhongshis);
}else if(pname=="榆林市"){
    drawColor("榆林市",yulinshis);
}else if(pname=="安康市"){
    drawColor("安康市",ankangshis);
}else if(pname=="商洛市"){
    drawColor("商洛市",shangluoshis);
}else if(pname=="兰州市"){
    drawColor("兰州市",nanzhoushis);
}else if(pname=="嘉峪关市"){
    drawColor("嘉峪关市",jiayuguanshis);
}else if(pname=="金昌市"){
    drawColor("金昌市",jinchangshis);
}else if(pname=="白银市"){
    drawColor("白银市",baiyinshis);
}else if(pname=="天水市"){
    drawColor("天水市",tianshuishis);
}else if(pname=="武威市"){
    drawColor("武威市",wuweishis);
}else if(pname=="张掖市"){
    drawColor("张掖市",zhangyeshis);
}else if(pname=="平凉市"){
    drawColor("平凉市",pingliangshis);
}else if(pname=="酒泉市"){
    drawColor("酒泉市",jiuquanshis);
}else if(pname=="庆阳市"){
    drawColor("庆阳市",qinyangshis);
}else if(pname=="定西市"){
    drawColor("定西市",dingxishis);
}else if(pname=="陇南市"){
    drawColor("陇南市",longnanshis);
}else if(pname=="临夏回族自治州"){
    drawColor("临夏回族自治州",linxiahuizuzizhizhous);
}else if(pname=="甘南藏族自治州"){
    drawColor("甘南藏族自治州",gannanzangzuzizhizhous);
}else if(pname=="西宁市"){
    drawColor("西宁市",xiningshis);
}else if(pname=="海东地区"){
    drawColor("海东地区",haidongdiqus);
}else if(pname=="海北藏族自治州"){
    drawColor("海北藏族自治州",haibeizangzuzizhizhous);
}else if(pname=="黄南藏族自治州"){
    drawColor("黄南藏族自治州",huangnanzangzuzizhizhous);
}else if(pname=="海南藏族自治州"){
    drawColor("海南藏族自治州",hainanzangzuzizhizhous);
}else if(pname=="果洛藏族自治州"){
    drawColor("果洛藏族自治州",guoluozangzuzizhizhous);
}else if(pname=="玉树藏族自治州"){
    drawColor("玉树藏族自治州",yushuzangzuzizhizhous);
}else if(pname=="海西蒙古族藏族自治州"){
    drawColor("海西蒙古族藏族自治州",haiximengguzuzangzuzizhizhous);
}else if(pname=="银川市"){
    drawColor("银川市",yinchuanshis);
}else if(pname=="石嘴山市"){
    drawColor("石嘴山市",shizuishanshis);
}else if(pname=="吴忠市"){
    drawColor("吴忠市",wuzhongshis);
}else if(pname=="固原市"){
    drawColor("固原市",guyuanshis);
}else if(pname=="中卫市"){
    drawColor("中卫市",zhongweishis);
}else if(pname=="乌鲁木齐市"){
    drawColor("乌鲁木齐市",wulumuqishis);
}else if(pname=="克拉玛依市"){
    drawColor("克拉玛依市",kelamayishis);
}else if(pname=="吐鲁番地区"){
    drawColor("吐鲁番地区",tulufandiqus);
}else if(pname=="哈密地区"){
    drawColor("哈密地区",hamidiqus);
}else if(pname=="昌吉回族自治州"){
    drawColor("昌吉回族自治州",changjihuizuzizhizhous);
}else if(pname=="博尔塔拉蒙古自治州"){
    drawColor("博尔塔拉蒙古自治州",boertalamengguzizhizhous);
}else if(pname=="巴音郭楞蒙古自治州"){
    drawColor("巴音郭楞蒙古自治州",bayinguolengmengguzizhizhous);
}else if(pname=="阿克苏地区"){
    drawColor("阿克苏地区",akesudiqus);
}else if(pname=="阿图什市"){
    drawColor("阿图什市",atushishis);
}else if(pname=="喀什地区"){
    drawColor("喀什地区",kashidiqus);
}else if(pname=="和田地区"){
    drawColor("和田地区",hetiandiqus);
}else if(pname=="伊犁哈萨克自治州"){
    drawColor("伊犁哈萨克自治州",yilihasakezizhizhous);
}else if(pname=="塔城地区"){
    drawColor("塔城地区",tachengdiqus);
}else if(pname=="阿勒泰地区"){
    drawColor("阿勒泰地区",aletaidiqus);
}else if(pname=="石河子市"){
    drawColor("石河子市",shiziheshis);
}
//给不同的市赋予不同颜色
function drawColor(city,array){
    for(var i=0;i<array.length;i++){
        getBoundary(city,array[i]);
    }
}